[
  {
    "ID": 1,
    "Classline": "Vanguard",
    "Tier": 2,
    "Name": "Devoted",
    "Rating": [4, 4, 0, 0, 2],
    "Stats": "Devoted is a class focusing on Mas and Lck, with high modifier and growth in these two areas. Other than Mas and Lck, Devoted also has decent mod and growth in Dex and mediocre numbers in Mgt and Spd. The defensive stats of Devoted are horrendous. <br/>Devoted is a class focusing on Skill numbers as well as Crt, with decent Ddg, but its Acc, TSpd and Pwr are low, and its bulk is absolutely terrible.",
    "Character": "Amongst the four units capable of going into the Devoted class, Vissarion starts off as a Devoted. He also has the highest total growth amongst them. He will have extremely high HP and Mas growth, good Dex and Def and decent Mgt and Lck.<br/> Benji as Devoted will have the highest Mgt and Lck, making him an excellent Crit damage dealer, it will also give him slightly better Dex and Mas growth. He will also have passable bulk, making him a good choice for Devoted. <br/>Valeria will have decent Spd growth and great Dex and Mas, but her stats in other areas will be mediocre. <br/>Gwyn as Devoted has good HP, Mas and Lck, ok bulk mainly due to high HP growth, and decent growths in other areas.",
    "Upgrade1": ["Mid", "Low", "Mid", "Mid"],
    "Upgrade2": ["High", "Low", "Low", "Mid"],
    "Skills": "Devoted's passive boosts unit's Crit chance if enemy is inflicted with a debuff. However, Devoted only can apply 1 kind of debuff on its own, and none of the Vanguard units have a personal skill that applies debuff either. So Devoted has to either be content with 1 stack of passive, go into a tier 3 class that provides debuffs, or relies on teammates help. Spinning Blade is a skill that boosts Devoted's bulk by quite a bit. While it is not very synergetic with Devoted's dodgy not bulky stats, it does have good numbers due to Devoted's high Mas. It provides a nice defensive boost in case Devoted need to face a counter attack. It also can serve as a debuff cleanser in higher difficulties when debuffs starts to hinder Devoted's combat capabilities. Hemorrage is the synergetic skill Devoted can use to boost Crit chance together with appling Bleed to enemey, further increasing damage outcome. It is recommended to go for the cost down upgrade in order to apply debuff more readily, giving Devoted higher Crit chances.",
    "Tips": "Devoted is a combat class with good Mas and crit chance. It also has some Block skill for extra bulk. You would like to stack some more Crit onto Devoted, as well as use items that boost damages.<br/> Devoted is not a bulky class, and its Dodge is also shaky, so players need to be careful with enemy phase tanking. Best use of Devoted is for attacking on player phase to deal Crit damage to enemies with weak Def hoping for a kill.",
    "Rings": "Rings providing extra critical are the best for Devoted: Dominator and Destiny ring are good. Rings that increases combat damage can also be considered.",
    "Weapons": "Axes and runes",
    "Class": "Devoted's natural progression is Reaper, a highly synergetic class as Reaper also focuses, if not more focused, on Critical chance and damage. Devoted's Crit chance boost would be useful if enemy is debuffed.<br/> Ancarant is a decent choice for Devoted to go into due to having a skill that can apply up to 2 debuffs to enemies, giving Devoted 3 stacks of its passive."
  },
  {
    "ID": 2,
    "Classline": "Vanguard",
    "Tier": 2,
    "Name": "Nightblade",
    "Rating": [3, 3, 4, 0, 4],
    "Stats": "Nightblade is a Spd focused class with good Frt as well. The class has good stat modifier in Spd and Frt, as well as decent Dex and Lck, modest Mas, but terrible modifier in HP, Mgt and Def. <br/>In term of growth, Nightblade similiarly excels in Spd and Frt, and also sport a decent Mas growth. Dex growth is also decent but Lck growth is mediocre. The class's growth in HP, Mgt and and Def are poor.<br/> Overall the class excels in TSpd and Ddg, have decent Acc, Crt and ok Skill Num. Its Bulk and Pwr are atrocious.",
    "Character": "Amongst the four units capable of going into the Nightblade class, Valeria starts off as a Nightblade. She also has the highest Spd, Dex and Frt growth amongst them. Nightblade will bring out the stength and weakness of Valeria, making her one of the fastest unit in the game, a great dodge tank and magic enemy killer, with good Acc and Skill number, but bad physical bulk and very low damage dealt at base. <br/> Benji is the opposite of Nightblade, which makes Nightblade a great complement class for him if he wish to patch up his Spd, making him a good all-rounder combatant. <br/>Gwyn will have good Spd, Mas and Frt, stats that she may want to bring into her tier 3 class choice, similiar to Vissarion, but low HP and Mgt maybe a concern if they wishes to be a bulky unit or high damage dealer.",
    "Upgrade1": ["High", "High", "Low", "Mid"],
    "Upgrade2": ["Low", "Mid", "Mid", "Top"],
    "Skills": "Nightblade is a dodge tank class, and its skills capitalise on this further. Nightblade's passive increases the class's Ddg further if you use skills continuously, up to 40%, making enemy hit rate well below 40% with ease. <br/>The active skills complement this even further, Grim Stroke applies Poison to enemy, decreasing their Acc further for even more \"Dodge\" on unit, as well as decreasing enemy's Def to boost Nightblade's otherwise lackluster damage output. On lower difficulties, it is better to decrease its mana cost to allow more uses of te skill as consective usage of skills is essential to keep up Nightblade's Ddg passive. On higher difficulties, it is useful to give it extra range as Nightblade can better support other damage dealers instead of having to deal the damage itself.<br/> Fleet Feet increases Spd of target, which also in turn increases Ddg. If the skill is applied to self, it is not uncommon for Nightblade to just receive 40 Ddg instantly off this skill alone. It is essential to get the self-cast buff for this. Increased duration is also decent way to keep up the Ddg just in case there is a break in skill usage. ",
    "Tips": "Nightblade is a good utitlity unit that is great in many areas. It is a great dodge tank in game, capable of doubling most enemies in combat. Nightblade may struggle to damage high Def enemies in higher difficulties but it does have Poison in its skillset to offset this problem. It has decent support potential too as it can debuff enemies or buff teammates or self effectively, making it useful in a lot of different situations.",
    "Rings": "Nightblade is a dodge-centric class, thus any Ddg increasing rings are appreciated. Depth and Diplomat rings are the first to come to mind, but Nightblade's low Mgt and thus kill power makes them less than ideal. Drunkard is a decent choice, as it provides good Ddg if Nightblade's skills are not active, and a decent failsave even if they are. Damage boosting rings are also great for boosting Nightblade's power. <br/>Advantage ring gets a special mention as Nightblade has great Spd and good Mas, good Mas means the ring is more effective, and good Spd means Nightblade can double and take advantage of the damage boost twice per round of combat.<br/> Charged ring is also an interesting choice as it provides more mana generation and can sustain Nightblade's skill usage longer.",
    "Weapons": "Daggers and runes",
    "Class": "Nightblade naturally progresses into Ancarant class, which is a good fit as Ancarant is also a dodge tank class, with passive that synergies really well with Nightblade's passive and active skills.<br/> Champion is not a great class, but Nightblade can provide the Spd growth for Champion to avoid getting doubled by the slower enemies, as well as more Frt for better bulk. <br/>Reaper and Ellisant do not particularly need Nightblade, but the extra Spd is always welcomed regardless."
  },
  {
    "ID": 3,
    "Classline": "Vanguard",
    "Tier": 2,
    "Name": "Seeker",
    "Rating": [4, 5, 2, 0, 3],
    "Stats": "Seeker is a class focusing on Dex and Mas, as well as good Mgt. Its HP, defenses and Lck modifiers are 0 or 1, and a negative in Spd modifier. Its growth are similiar with a focus on great Mgt, Dex and Mas, a surprisingly decent Def growth, subpar HP, Frt and Lck growth, and lastly a bad Spd growth.<br/> Seeker focuses on having good Skill Number and Acc, with above average Pwr and slightly below average bulk. It can convert SKill Numbers into Pwr but have poor TSpd, Ddg and Crt.",
    "Character": "None of the characters you have starts off in this class. Base on growth, Vissarion probably fits the most as he has the highest Mas and joint highest Dex and better Mgt than Valeria who also has the joint highest Dex growth. Vissarion also sports a good physical bulk for safer combat scenario although low Spd and Frt makes tanking not desirable. <br/>Benji will probably be the best damage dealer amongst the four as a Seeker with a balanced mix of Mgt, Dex, Mas and Lck, while Gwyn is decent overall with acceptable growth in all areas except maybe Spd.",
    "Upgrade1": ["Mid", "Mid", "Mid", "Low"],
    "Upgrade2": ["Mid", "Low", "High", "Mid"],
    "Skills": "Seeker's passive applies a debuff on enemy, making it easier for your teammates to kill that turn. It is handy and fits into Seeker's role as a chip damage dealer. <br/>Illuminate gives more Acc to self or teammates, a skill more inclined to higher difficulty settings where Acc at base are less reliable. Increasing duration is a nice boost as it turns Illuminate into a 25 cost 3 turn skill. Increasing range and allowing self-cast gives the skill more flexibility in Seeker's positioning. <br/>Enchant Weapon is the core skill for Seeker, providing a decent damage boost to the unit's own attacks. Casting it again before the effect from the first cast runs out will increase the duration further, but not further increasing the damage dealt. Increasing duration is better in terms of cost efficiency compared to cost reduction, but both can picked for maximum efficiency. If debuffs are an issue for you, clearing target debuff is a decent choice.",
    "Tips": "Seeker is a ranged class that cannot counter at 1 range, thus you need to position it carefully as Seeker can neither tank nor counter if attacked by enemies at melee range. Its skill duration can stack and will not exhaust if not entering combat so it is advisable to stack up damage boost during the waiting window before engaging the enemy. <br/>Seeker is best at chipping away enemy health before others can finish it off as it can deal good damage but cannot double, often unable to ORKO enemies, and can attack at 2 range to avoid counter of melee enemies.",
    "Rings": "Seeker would prefer some damage boost or skill number boost. Bloodied ring is a decent choice to boost Seeker's combat capability, providing not only Pwr but valuable TSpd and Crt boost, allowing Seeker to double some enemies in the early-mid game.<br/> Blazing ring is a nice option as the 50% damage boost it provides stacks multiplicatively with Enchanct Weapon.<br/> Mystic or Lava ring can also be used as enhancing the effect of Enchant Weapon can be very beneficial for Seeker.",
    "Weapons": "",
    "Class": "Seeker naturally progresses into Ellisant class. Ellisant allows unit to safely attack enemy from very long range, similiar to how Seeker can chip down enemies at a distance. Seeker's Enchant Weapon is also useful in giving Ellisant more damage.<br/> Other than Ellisant, Seeker can also provide useful damage boost to Ancarant or Reaper, but mana cost and class passives are less syerngetic than their natural counterparts."
  },
  {
    "ID": 4,
    "Classline": "Vanguard",
    "Tier": 2,
    "Name": "Gallant",
    "Rating": [2, 4, 2, 0, 3],
    "Stats": "Gallant has a high HP modifier and good Mgt modifier. All of its other modifier are very moderate. In terms of growth, Gallant focuses on HP, Mgt and Def, with decent Dex and moderate Mas. Its growth in terms of Spd, Frt and Lck are abysmal.<br/> Gallant is a class focusing on physical Bulk and raw Pwr. Its performance in terms of Skill Num, Acc, Ddg and Crt are all well below average.",
    "Character": "All four characters that have access to Gallant class will have absurdly high HP growth. Benji starts off naturally in this class, and has highest Mgt and joint highest Def growth. It is a min-max class that sacrifices Spd and Mas, as well as very mediocre Dex, Frt and Lck, for HP, Mgt and Def. <br/>Vissarion with his personal growth is even more min-max, with much better physical bulk, but even lower Frt and Lck. His Spd is still bad but he does get respectable Mgt, Dex and Mas. <br/>Valeria becomes a more balanced unit in Gallant, having good Mgt and still decent Spd, good overall Bulk and decent Dex and Mas, but her Lck growth will be butchered completely.<br/> Gwyn makes a great combatant in Gallant too, having high HP, Mgt, Def and decent Dex and Mas. Nothing is too terrible about Gallant Gwyn except slightly subpar Spd, Frt and Lck. ",
    "Upgrade1": ["High", "Mid", "High", "Low"],
    "Upgrade2": ["Low", "Mid", "Low", "Low"],
    "Skills": "Gallant's passive is a decent damage boost against enemies at full HP. It allows Gallant to have more OHKO potential, or simply deal more damage when it opens up a path amongst enemies. The condition is lenient enough and can still work even after enemies have been chipped. <br/>Call to Arms is the more useful skill for Gallant, providing a nice damage boost to all allies within range. Increasing its duration is very useful especially if you are not moving much for next turn, though just 1 more turn is usually good enough. <br/>Overpower is a weird skill as Gallant is a 1 range unit, pushing enemies away from Gallant seems counter-productive. It can be used to push allies butthe debuffs goes to waste. It can also be used to apply debuffs to enemies who cant be moved, but that is a waste too. Overall a weak and anti-synergetic skill not worthy most of the time.",
    "Tips": "Gallant is a physical powerhouse will good tanking potential on the physical side. Its skills and Skill numbers are all not great, and its low Spd and Frt makes it extremely vulnerable to Magical enemies. It is advisable to make Gallant avoid Magical enemies at all cost, unless Gallant can kill of said enemy before it counters. Gallant however, is good at deleting enemies with its high destructive Pwr and can take a few physical hits in return, so use Gallant to fend off otherwise dangerous Physical enemies.",
    "Rings": "Bloodied ring is always a good choice for combat focused class, not an exception for Gallant. <br/>Blazing ring will also stack with Gallant's passive and Call to Arms, making it a decent choice. <br/>Tranquility, Dauntless, Guardian, Indomitable and Dimming are all possible options if you wish to boost the bulk of Gallant. Equilibrium is also an option if you find Gallant's low Frt a crippling issue.",
    "Weapons": "",
    "Class": "Gallant naturally progresses into Champion class, a class that also focuses on raw Pwr and combat damage. It is a good fit for Gallant.<br/> However, Gallant also would do well going into Reaper, as Reaper's passive condition conincides with Gallant's and can result in good damage."
  },
  {
    "ID": 5,
    "Classline": "Hunter",
    "Tier": 2,
    "Name": "Ranger",
    "Rating": [4, 3, 1, 1, 3],
    "Stats": "Ranger has good stat modifier in HP and Mgt, and bad in Dex, Frt and mostly Mas. Growth wise Ranger has good growth modifier in HP, Mgt and Def, its Frt growth is bad and Mas growth is terrible. Its growth in Spd, Dex and Lck are mediocre.<br/> Ranger is the tank class of Hunter classline, focusing on Bulk and Pwr. Its TSpd and Ddg surprisingly decent for a tank but its Skill num is absolutely atrocious, it is the worst class in terms of Mas in the entire game.",
    "Character": "Amongst the four units capable of going into the Ranger class, Tusk starts off as a Ranger. He has monstrous HP growth as Ranger, as well as great Mgt and Def. His other stats are mediocre, and Frt and Mas growth are atrocious, a typical tank build. <br/>Zanele will have decent bulk as Ranger, having good Mgt too. However it is not recommended as her personal skill will be rendered much less effective due to low Mas. <br/>Eve is also not recommended as a Ranger as while her bulk and Mgt are decent, her Spd will take a hit making her double less enemies.<br/> Riordan has great bulk and Mgt too as a Ranger, and have decent Mas and Lck too. His Spd and Dex will become an issue but if looking pass those Riordan will make a great Ranger.",
    "Upgrade1": ["Low", "Low", "Mid", "High"],
    "Upgrade2": ["Mid", "Mid", "Mid", "Top"],
    "Skills": "Ranger's passive gives itself more Bulk when it falls below half HP, and can trigger again if Ranger is healed above half HP and then falls below the threshold again. It is extremely powerful early game and secures Ranger as the best tank early game. It can even tank Magical attacks decently as Block will reduce Magical damage as well.<br/> Lanky Spanky does not have a Mas scaling to it, which is not a bad thing considering Ranger's low Mas. Stack increase is actually duration increase here, which can buy valuable time for your units to deal with threathening enemies. Stun in this game is not as mighty as other iterations as it does not stop the stunned unit from countering enemy attacks, but is still useful to stop them from attacking you during enemy phase.<br/> Command Orangutan is a standard Hunter class Red skill which is essentially a normal attack with an extra skill damage and effect attached. Exhaustion is just an ok debuff, but does help against dodgy enemies like Rogue, Witch or Sellsword. Mana cost down and increased stacks are all nice bonuses, but the healing is the more useful upgrade here, as Ranger is a tank unit with no healing outside of this. Healing will not only increase the longevity of Ranger, but can also bring Ranger above half HP threshold to potentially trigger its passive again.",
    "Tips": "Ranger is a tank class that can also deal good damage back. It is one of best tanks early game and can reliably ward off enemies when the situation arises. However, Ranger's effectiveness will start to decrease as the game progresses, earlier if difficulty is higher. This is due to its passive being static and its low Acc starts to catch up. Low Skill number also does not help as other units start to deal better damage with Skills.<br/> It is recommended to go into a tier 3 as soon as possible and use Ranger's skills as a support rather than stick to Ranger.",
    "Rings": "Ranger should focus on increasing its Bulk to tank better. Tranquility, Dauntless, Hollowed, Guardian, Indomitable and Dimming are all possible choices. Guardian is synergetic with Ranger's passive to give Ranger more Bulk when below half HP, and Dimming can remove Ranger's ineffective Mas stat to provide further boost to defenses, though due to Ranger's low Mas, the boost will be small. ",
    "Weapons": "",
    "Class": "Ranger naturally progresses into Warden, which is also the most synergetic tier 3 class for Ranger. Warden is a tank class with better stats and another passive than further boosts Def, picking up in terms of Bulk while Ranger alone is falling off.<br/. Ranger's overall skill effects are not impressive, and thus is generally not considered if Warden is not the tier 3 class of choice."
  },
  {
    "ID": 6,
    "Classline": "Hunter",
    "Tier": 2,
    "Name": "Cutthroat",
    "Rating": [4, 4, 3, 1, 5],
    "Stats": "Cutthroat's stats focuses on Spd and Lck, with a little stat boost to Dex and Frt, as well as slightly negatively impacts HP, Mgt and Mas. In terms of growth, Cutthroat has bad HP, Mgt and Frt growth modifier, as well as atrocious Def, but it excels in Spd, Dex and Lck, and has ok Mas growth. <br/>Cutthroat is very obvious a fast dodge tank, having good Ddg BEFORE counting in its passive, patching up its relatively low Bulk, and has no trouble doubling most enemies. It also has very high Crt with decent Acc, which can patch up its low Pwr dealing low damage per attack. Its only real weakness is its relatively low Skill Num, but it does not stop Cutthroat from being one of the best tier 2 classes.",
    "Character": "Amongst the four units capable of going into the Cutthroat class, Eve starts off as a Cutthroat. She is also the most aligned in terms of growth. Eve has the single highest Spd growth in the entire game as a Cutthroat, with insane Lck growth to boot. Her HP growth is actually not terrible either, but her defense are quite low. She also has low Mgt and Mas growth, which prevents her from being a perfect unit.<br/> Zanele is also quite fast as a Cutthroat, and slightly better growth in most other areas compared to Eve other than HP, most notable is her high Mas growth which Eve lacks. However, Zanele does suffer from a low Lck growth, which is anti-synergetic with Cutthroat's passive, making her not as compatible with the class compared to Eve. <br/>Tusk can be quite a fast and strong combatant as a Cutthroat, with his passive essentially providing more Spd. His Ddg is nowhere near as impressive as Eve's but with his monstrous HP and better Def it is not a bad combination. <br/>Lastly, Riordan has the best total growth, but will have a more balanced spread across the board. Cutthroat Riordan will not be a bad unit, but will be less ideal than the other specialists out there.",
    "Upgrade1": ["Top", "Mid", "Top", "Mid"],
    "Upgrade2": ["Mid", "Mid", "High", "Low"],
    "Skills": "Cutthroat's passive is one of the most powerful and synergetic passive in the game, utilising the class's high Lck to push Ddg to insane level. Cutthroat does not have the highest Ddg in game at base, but with passive it becomes the highest Ddg in game by far, possibly only matched by Nightblade with 2 stacks of Shadowstep.<br /> In term of active skills, Licky Lasso is yet again one of the best Blue skills in game, being able to drag enemies towards you at a distance. You may use this skill to drag in bosses from far away towards you and end the chapter much earlier. Increasing range is the best option as it is unlikely to increase much otherwise due to Cutthroat's relatively low Mas.<br /> Command Toad is a more standard Hunter class Red skill that often gets overlooked in favour of Lick Lasso. It offers Poison debuff, the strongest type of debuff in the game, which can boost Cutthroat's relative lower damage instance. Increasing the number of stacks is very effective due to how Poison works in this game. Healing is unnecessary as Cutthroat as a dodge tank seldom takes any damage.",
    "Tips": "Cutthroat is a dodge tank, possibly the better form of tanker in this game compared to bulky tankers. Cutthroat is thus great in the front line and unlike Nightblade, deals better damage due to much higher Crt potential. You do need to look out for enemies with Precision and Trueseeing, they can be quite dangerous as Cutthroat's bulk without Ddg is very low. Otherwise, you can usually throw a good Cuthroat into a crowd of enemies without much worry.",
    "Rings": "Rings providing extra Ddg is good for Cutthroat: Depth and Diplomat rings are recommended. Drunkard is okay but less recommended due to innate high Ddg of Cutthroat diminishing its effectiveness.<br/>Cutthroat can also take advantage of Farseer ring as Licky Lasso has 2 range increasing upgrades, essentially gaining +4 Range with Farseer ring and upgrades.",
    "Weapons": "",
    "Class": "Cutthroat naturally progresses into Slayer, which is also a good dodge tanker class. Slayer is a great 1-2 range class and has a passive to boost damage output, one thing Cutthroat lacks, making Cutthroat/Slayer one of the best in the game. <br/>Deadeye is also a great choice as it is also a fast class with decent Lck. Deadeye also has better Mgt and Mas, making Cutthroat/Deadeye is clas with both good Pwr and Ddg. The disadvantage other than having less Crt is that Deadeye is a 2 range only class, decreasing its enemy phase potential. <br/>Beastmaster and Warden are slow classes that will be balanced out by Cutthroat's growth, but is otherwise not recommended."
  },
  {
    "ID": 7,
    "Classline": "Hunter",
    "Tier": 2,
    "Name": "Tamer",
    "Rating": [3, 1, 2, 5, 4],
    "Stats": "Tamer is a class focusing on HP and Mas, with very high modifier in these two stats, but bad modifiers everywhere else. In terms of growth, Tamer has good HP growth and an impressive 40% in Mas. Its Mgt, Def and Frt growth are also decent, and Dex growth is ok. However, Tamer's Lck and Spd growth are terrible. <br/>Tamer is a class focusing on Mas and Skill num. It has decent Bulk due to HP but its defense are only decent. Its Pwr is below average, and its TSpd, Ddg and Crt are bad.",
    "Character": "None of the characters you have starts off in this class. Zanele is usually most recommended in this class due to her extremely valuable and unique personal skill. Tamer's growth in combat related stats are secondary, it is the best at providing highest Mas growth on par with Cosmician to give units extremely effective skills.<br/>Tusk is an interesting choice with a monstrous HP growth exceeding 100%, with the potential to get 3 HP in a single level up. His Mgt and Mas growth are both great, making his personal skill extremely heavy hitting. However, Tusk's personal skill and Tamer's skill will coincide in terms of effect.<br/>Riordan has surprisingly good growth spread with Tamer, giving him very good HP, Def and Frt and excellent Mas. While neither Riordan nor Tamer's skills are particularly impressive, the combination of highest total growth unit and tier 2 class makes Tamer Riordan a titan in terms of stats.<br/>Eve will receive balanced growth in Tamer class, but having no stats standing out is not great for Eve. Eve's personal skill is also not worthy of going into Tamer and give up powerful alternatives like Cutthroat.",
    "Upgrade1": ["Mid", "Mid", "Mid", "Low"],
    "Upgrade2": ["Low", "Low", "High", "Mid"],
    "Skills": "Tamer's passive is extremely synergetic with the core idea of the class: dealing huge damage with pet commands, adding more Mas scaling to Pet commands, in a class  with high Mas growth and sta modifiers. Do note that only the Red skills are considered Pet Commands and the Blue ones do not get affected by this passive. <br/>Call the Pride is a decent support skill giving Light Block to teammates, boosting their Bulk slightly. Its cost is expensive and only last 1 attack per unit. It is usually used as an emergency measure rather than common use. Decreasing its cost or increasing total stacks given is usually prefered. <br/>Command Lion is a Red skill and boosted by Tamer's passive, essentially making it 125% Mas scaling before upgrade. Unlike most other Pet Commands, this one has no secondary effects and instead have high Mas scaling, something Tamer likes. Increasing its scaling further is highly effective, and allowing the skill to heal can be helpful as Tamer has high HP but not too high defenses or far range, thus may be lacking a large portion of HP very often.",
    "Tips": "At base, Tamer will have some of the worst combat performance, with no good Spd to double or even avoid getting doubled, Crt to boost damage, or good Acc to ensure accurate attacks. Its Pwr and defenses are not particularly great. However, Tamer makes up for it with simple raw Skill numbers. with high Mas and a passive to boost Skill numbers further, Tamer using pet commands are absolutely devasting and very good at deleting enemies player phase. While their enemy phase performance are not good by any means, at least its huge HP pool will make sure Tamer can survive until player phase.",
    "Rings": "Tamer is a Skill Num focused class, thus Mystic and Lava rings are extremely beneficial to Tamer. Lava ring is stronger and would be the most effective option, but Mystic ring is also very good and a great option if you have more than one unit focusing on skills. <br/> Mana related rings are also great. Companion ring specifically works for Pet commands and is probably the most synergetic ring with Tamer. Charged ring is similiarly useful, allowing more uses of Pet commands every battle.",
    "Weapons": "",
    "Class": "Tamer naturally progresses into Beastmaster, which is also a Skill num focused class, extremely synergetic with Tamer and should be the only viable option if the unit is built for Tamer already.<br/>However, A unit previously not in Tamer class can go into Tamer before promoting into any other tier 3 class if they want to utilise Tamer's passive for a boosted Pet Command."
  },
  {
    "ID": 8,
    "Classline": "Hunter",
    "Tier": 2,
    "Name": "Quickdraw",
    "Rating": [4, 5, 2, 2, 2],
    "Stats": "Quickdraw focuses on Spd and Dex with slight positive Mgt stat modifier. It has a highly negative HP modifier and -1 in Def and Frt. In terms of growth, Quickdraw heavily focuses on Mgt, Spd and Dex, and has very bad growth in terms of HP, Def, Frt , Mas and Lck. <br/> Qucikdraw is a very combat focused class, with decent Pwr, great TSpd, Acc and Acc, but low Skill num, Crt and abysmal bulk.",
    "Character": "Amongst the four units capable of going into the Quickdraw class, Zanele starts off as a Quickdraw. She has very high Spd, Dex, Mgt and Mas growth, but has mediocre HP, Def, Frt and Lck growth. This will make her a very capable combat unit, but does not utilise her special personal skill as effectively as Tamer.<br/>Eve will be just as fast compared to Cutthroat and will have better Mgt. However, her Ddg will be compromised without Cutthroat's passive, making it less than ideal as her bulk also gets worse.<br/>Riordan's high personal growth makes him a functional Quickdraw with decent bulk and great combat. However, he does have least Spd growth amongst all Hunter unit, something Quickdraw does not desire.<br/> Tusk is surprisingly capable as Quickdraw, as he will get good Spd growth together with high HP, Mgt and Dex. His physical bulk is impressive and magical bulk is bad but still managable, as most enemies cannot double him and will not defeat him easily through his huge HP pool.",
    "Upgrade1": ["Low", "Mid", "Low", "Mid"],
    "Upgrade2": ["Low", "Low", "Mid", "Mid"],
    "Skills": "Quickdraw's passive gives the unit 5 Mana if a follow-up attack is performed. It is not a very useful ability as follow-up attacks are not very consistent, possibly due to having to fight fast enemies Quickdraw struggle to double, or outright killing a weakened enemy without needing to follow-up. Enemy phase follow-up is also hard to do as Quickdraw is a 2 range unit. <br/>Wicked Cackle is an AOE debuff skill which applies Weak to enemies. it is a weird skill as Weak reduces damage dealt by enemy, something Quickdraw does not really utilise well as Quickdraw cannot tank and would prefer to outright kill enemies. It can help to support teammates if there are numerous enemies that player cannot take out in one turn but it is highly situational.<br/>Command Hyena is your typical Hunter Red Skill that deals extra damage in addition to a normal attack and applies a Bleed debuff, adding even more damage to it. It is essentially just more damage, something welcomed by a damage-centric class. Adding a heal for some utility or increase stacks for more damage is preferred.",
    "Tips": "Quickdraw is a combat focused class, with good damage, fast speed for doubling and accurate attacks. Players should focus on Spd for doubling as it will trigger the class's passive. While Quickdraw's Skill num is not very good, as Hunter's skills are based off a normal attack, players can still expect good damage output. As Quickdraw has a way to refill Mana, players should not hesitate to use skills whenever necessary.",
    "Rings": "Quickdraw would prefer rings that improves battle performances. Grip increase TSpd equals to half of weapon weight, which might be useful if you opt for heavy weapons. Kindling increases Pwr every time mana is spent, which can be useful to combo with Quickdraw's mana regen for more Skill usage.<br/> Crit increasing rings are also great due to Quickdraw's high Mgt and Spd, so Soulfire and Dominator can be considered. <br/>Finally, Archmage is an interesting pick as Quickdraw is a 2 range unit and its skills depend on attack range, which means it qualifies for the condition needed to trigger Archmage ring's effect, essentially giving Quickdraw 1 extra attack range.",
    "Weapons": "",
    "Class": "Quickdraw naturally progresses into the Deadeye class, with similiar stas and growths. It is also a good combat class and plays quite well. <br/>Slayer is a decent choice which is also fast, and has 1-2 range, which utilises Quickdraw's passive much better than Quickdraw itself or Deadeye, making it a great choice too.<br/>Warden and Beastmaster are too slow to utilise Quickdraw's passive, and Quickeye does not really have strong skill effects, and the classes would much rather have Cutthroat for better Spd growth."
  },
  {
    "ID": 9,
    "Classline": "Summoner",
    "Tier": 2,
    "Name": "Geomancer",
    "Rating": [3, 2, 5, 2, 3],
    "Stats": "Geomancer is a class focuses on Mas and Lck. It has great stat modifier in Mas and Lck, and good modifier in HP and Def. Its Spd and especially Frt stat mod are negative. In terms of growth, Geomancer has great HP and Mas growth, decent Mgt, Def and Lck growth and low growth in terms of Spd, Dex and Frt.<br/> Geomancer is a Skill focused class with great Skill Num and decent Bulk, but lackluster in terms of combat with below average Pwr, Ddg, TSpd and Acc. It does however, has decent Crt potential.",
    "Character": "Amongst the four units capable of going into the Geomancer class, Calith starts off as a Geomancer. She has the highest Dex and Lck growth amongst all. She has good HP and Lck, but all her other growths are mostly mediocre, making her not so good interms of either combat or Skill num. <br/> Athur has the highest Mas growth and can get insanely high Mas for extremely powerful skills. He also will get good Mgt and decent Bulk, making his combat performance more tolerable. <br/> Alden will have high HP growth, good Def and Mas growth and decent Mgt and Frt. He will be a bulky unit with good Skill num. <br/> Finally, Aya will be more min-mix with good Mgt, Mas and Lck, decent HP, Dex and Def but mediocre Spd and poor Frt.",
    "Upgrade1": ["High", "Low", "Low", "High"],
    "Upgrade2": ["Low", "Mid", "High", "Mid"],
    "Skills": "Geomancer's passive is a slight buff to teammates. If more than 2 allies are within range, 2 will be buffed at random. The skill is nice to have in the early game but even then it is not strong. It quickly becomes quite irrelevant and not something players usually pay attention to due to the buff provided being too small. <br/> Starsurge is similiar to Rescue from Fire Emblem series but can also deal damage to enemies adjacent to target. The Rescue part is highly useful to get allies move long distance, but the damage is situational. Cost down to allow more usage is highly preferred, and range increase is very useful early game when Mas is still low. Caster healing is not recommended as it is rarely used to deal damage.<br/>Moonlight works similiar to Physics in Fire Emblem, and can heal allies from distance, making it an extremely useful healing option. Geomancer with its high Mas can usually heal allies from very far away. Range increase is useful early on and can be replaced later if seems redundant. Player can choose debuff removal if debuffs are prevalent, or give mana to target for better support.",
    "Tips": "Geomancer is a class focusing on good Skill numbers. Not only does it have good skill growth, but also good skill effects, though the effects are supportive and usually not offensive. If player wants good skill numbers later for their units, they can consider levelling up in Geomancer first. Geomancer should not usually be used for combat and should only be used sparingly and avoid enemy phase combat.",
    "Rings": "Geomancer is a skill focused class, and thus would appreciate skill bosting rings such as Mystic and Lava rings. Skill range increasing effects such as Archmage and Farseer ring are also great. <br/> Heir ring is also a good match as Geomancer has good HP and boosting Mastery is greatly appreciated.<br/>If player wish to make Geomancer a more combat focused class, Surefire, Advantage and Bloodied ring are possible options, all of which utilises the class's good HP or Mas to boost combat performances.",
    "Weapons": "",
    "Class": "Geomancer naturally progress in to Cosmician, a class that offers one of the highest Mas growth in game, as well as passive that gives extra Mas, which can significantly boost the effects of Geomancer's skills. A perfect upgrade for Geomancer. <br/> Other tier 3 classes does not offer much to Geomancer, but will appreciate Geomancer's high Mas growth to boost their own Skill num.   "
  },
  {
    "ID": 10,
    "Classline": "Summoner",
    "Tier": 2,
    "Name": "Warlock",
    "Rating": [1, 3, 4, 4, 2],
    "Stats": "Warlock focuses on Mgt and Dex, but lacks any good stat modifier in any other areas. In terms of growth, Warlock's Frt growth is the highest, Mgt and Dex growth are also great. However, all of Warlock's other growth are very lackluster.<br/> Warlock is a class not focused on stats and growth, but on skill effects. In terms of stats, Warlock has above average Pwr and Acc, but below average Bulk, TSpd and Ddg, Skill num and Crt are even less impressive.",
    "Character": "Amongst the four units capable of going into the Warlock class, Aya starts off as a Warlock. She has the highest Mgt, Spd and Lck, though her Spd is still not good enough to make her double most enemies. She has good Dex and Frt, but mediocre Mas and HP and terrible Def. Her Skill num is not very good and her combat is passable but shaky.<br/>Arthur has an impressive 60% Frt as Warlock, with good Mgt and Mas too. His Skill num is better than Aya's and his higher Bulk makes him better at combat than Aya most of the time as he is less likely to die to stray hits from enemies.<br/>Alden will have decent bulk but his low Spd and Mas makes it not a great choice, and Calith's low personal Mas growth will likely waste the good effects on Warlock.",
    "Upgrade1": ["Low", "High", "Low", "Top" ],
    "Upgrade2": ["Mid", "Top", "High", "Mid"],
    "Skills": "While Warlock has one of the least apealing stat growths out there, it is made up by having possibly the most powerful set of passive and active skill effects in the game. Warlock's passive Blackflame allows Warlock to heal himself whener his attacks hits a Poisoned enemy by the same amount as damage dealt. As Warlock has good Mgt, it is not unlikely for Warlock to take a hit and then heal back to full, making Warlock a vampiric tank, or Nos-tank going by Fire Emblem terms.<br/>Warlock's Hellfire skill is one of the best Red skill in game as it not only has a high Mas scaling for damage, it also has a Mas scaling (albeit a low one) for range, making this skill not only hits much harder, but also further as you progress. Though player should note that Warlock itself does not make this skill super good, it needs the help of high Mas classes such as Cosmician to push it to absurd level of power. Increasing its power would be a top priority to make the spell more powerful and increasing range will make the skill hits further early on before Mas stat starts to matter. The heal is unnecessary because Warlock has much better form of healing already.<br/>Posion Nova is the crucial part of Warlock's kit, triggering Warlock's passive for healing and longevity. Even when Warlock's passive is not considered, a large Aoe Poison is a strong support for teammates to more effectively deal with weakened enemies. Increasing range is absolutely essential, and unlike a few other AOE, Poison Nova's effect is not weakend by having more targets. Increasing effectiveness and lowering cost are also fine upgrades to consider afterwards.",
    "Tips": "Warlock is a class focusing on Skill effects, which will complement the class's otherwise lackluster stats. It is better to grow in another class such as Geomancer for better Mas or other Scholar for more balanced combat and Mas stats before going back into Warlock. Warlock is actually a powerful choice for the class of choice before going into tier 3, as much as it is not a choice for good growth and stats.",
    "Rings": "For Hellfire optimising build, increasing skill effect rings are prefered. Lava ring is the best because it increases not only the damage but also the range. Inferno ring is the strongest in terms of increasing Skill num and Hellfire is one of the few skills that can benefit from it. Range increasing rings also works so Archmage and Farseer rings are good.<br/>If player wishes to optimise for Nos-tank combat, then Chosen ring is a must have, as Warlock's low Bulk may result in unit unable to recover fully from strong enemy attacks. Chosen ring makes sure that Warlock can only be defeated in 3 hits regardless of how strong the enemy is. Farseer ring is once again a good option as it can also increase the AOE of Poison Nova. Bloodied ring is also an option as it can increase TSpd of Warlock, something a combat Warlock sorely desires.",
    "Weapons": "",
    "Class": "Warlock naturally progresses into Necromancer class, which has a stat spread similiar to Warlock. It is an ok class to be in, but offers nothing in particular for Warlock. Warlock's skillset is so strong that it usually cares not for tier 3 class's skillset, and would prefer the class to have a better stat modifier.<br/>Cosmician is the go to class if player wishes for Warlock to optimise the powerful Hellfire, as Mas will be the essential stat. No class in game offers more Mas than Cosmician with its high Mas growth and Mas increasing passive.<br/>If combat and Nos-tanking is the preferred way to play Warlock, then Loremaster is the best choice because Spd is the essential stat. The Nos-tanking strategy hinges solely on Warlock being capable of doubling enemies. It is also recommended to grow in Scholar first before going into Warlock or Grim Loremaster."
  },
  {
    "ID": 11,
    "Classline": "Summoner",
    "Tier": 2,
    "Name": "Aegis",
    "Rating": [2, 1, 3, 3, 2],
    "Stats": "Aegis's stats focus on HP and Def, it has a +1 in Mgt too. Aegis other stat modifiers are all 0 or negative, the lowest being Lck with a -2. In terms of growth, Aegis has decent HP and good Def and Frt growth, making Aegis a tanky class. All of its other growth are all lackluster.<br/> Aegis is the tank class of the Summoner line, with extremely high Bulk, but low in all other areas, especially Crt.",
    "Character": "None of the characters you have starts off in this class. Base on growth, Alden will have the best in terms of Bulk yielding the highest HP, Def and great Frt growth amongst the four units. All his other growth however, are either mediocre or abysmal. <br/>Aya has the most balanced growth in Aegis class, with no growth below 35%. However, it also means Aegis Aya has problem excelling in anything at all, espcially with mediocre Spd, below average Mas and middling Bulk making her excel in neither combat nor Skill num. <br/>Calith has lowest Mas growth, which is not something Aegis desires. While Calith's bulk is decent, Calith will not be doing much in return due to low Mgt and Spd.<br/> Arthur can be an Aegis due to having the highest Mas amongst all Summoner units. He will also have good Def and highest Frt. His combat may not be stellar, but at least Arthur is a great user of Aegis' Skills.",
    "Upgrade1": ["Low", "Mid", "Low", "Low"],
    "Upgrade2": ["High", "Top", "Mid", "Mid"],
    "Skills": "Aegis's passive increases the class's damage done if it took damage. It looks synergetic on paper but Aegis's damage output is still horrible even after the buff.<br/>Aegis's Relic Refraction applies AOE Blind to enemies, reducing their Acc and indirectly increases the longevity of your units. It is not a very reliable debuff as some enemies will still have considerable Hit chance after the debuff. This debuff is also anti-synergetic with the other skill of Aegis.<br/>Repulsor Shield is the signature ability, it is also the most effective way to deal with horde of enemies. If multiple instances of Repulsor Shield are casted onto the same target, the amount of damage will be added together. One stragtegy is to use multiple instances of Repulsor Shield on Juggernaut, and combine with Juggernaut's Wreathed in Flame for massive reflect damage to kill enemies during enemy phase. On higher difficulties, Godfrost with Absolute Zero can be a more reliable target. Increasing duration is the strongest upgrade as it aloows for more time and more stacks. Reducing mana cost is also great for more instances of skill usage.",
    "Tips": "Aegis is a tanky class capable of taking a hit, but does not do much in return with lackluster TSpd, Acc and Pwr. The class is generally more used as a support unit with nice skills and the tankiness helps in making Aegis less peculiar about positioning compared to the more squishy supports. Use Aegis for its skills, or as a shield against possible stray attacks on your more squishy units.",
    "Rings": "Aegis does not really need any rings to perform its job, but rings that increase its tankiness is still good. Hallowed, Dauntless and Indomitable are all good choices.<br/>Charged ring is also a possible option allowing for faster mana generation and more Repulsor Shield casts.<br/> Plague ring is niche but works well if player choose to use Aegis itself as Repulsor Shield target for enemy phase damage reflecting.<br/>Lastly, Solemn ring may not be the best ring for Aegis itself, it is a very synergetic ring to go with Repulsor Shield target. The ring basically removes dodge from the target and instead halves the damage taken 40% of the time, which is perfect for Repulsor Shield targets who do not want the enemy to miss their attacks.",
    "Weapons": "",
    "Class": "Aegis naturally progresses into Relic Knight class, which is a good tank class. It can carry on Aegis's legacy of being a tanky support capable of resisting stray attacks, but offers little skill wise.<br/>Cosmician is a good choice if you wish to optimise Repulsor Shield's Skill num due to its high Mas growth and Mas increasing passive."
  },
  {
    "ID": 12,
    "Classline": "Summoner",
    "Tier": 2,
    "Name": "Scholar",
    "Rating": [3, 3, 5, 0, 2],
    "Stats": "Scholar is a balanced class with no particular strength or weakness but has better modifier in Spd, Mas and Lck and worse modifiers in HP, Dex and Frt. Its growth focuses on Mgt, Spd and Mas, and has mediocre HP growth. Scholar's growth in Dex, Def, Frt and Lck are low.<br/>Scholar is a class with balanced between support and combat. It has good TSpd and Ddg, as well as decent Skill num, but has extremely low Bulk and Acc, as well as below average Pwr and Crt.",
    "Character": "Amongst the four units capable of going into the Scholar class, Alden starts off as a Scholar. He has good HP, Mgt, Spd and Mas, ok Def and Frt but low Dex and Lck. Alden has ok Bulk, TSpd and Pwr and Skill num, but low Acc will severely hamper his combat.<br/>Calith is similiar to Alden, but will have lower HP, defenses and Mas inexchange for much better Dex and Lck, makng Calith more combat focused.<br/>Arthur will have the best Mas amongst the four, and also good Mgt and Spd, making him good at using skills and attacking. He will also have decent bulk against Magical foes but his Acc and physical Bulk are lacking.<br/>Aya is probably the strongest in terms of combat Pwr with ok Dex and good Lck combined with great Mgt and Spd. Her Mas is also decent, bulk her Bulk will be severely lacking.",
    "Upgrade1": ["Mid", "Mid", "Top", "Mid"],
    "Upgrade2": ["High", "Low", "Mid", "Mid"],
    "Skills": "Scholar's passive allows unit to stack Frt as the battle continues, which can result in a sizable buff at the end of the battle. It is not extremely useful but can be great against hordes of powerful Magical enemies at the end of a chapter. Arthur's personal skill is a decent skill to go with as both will stack up on buffs throughout the chapter.<br/>Phase is a strong skill that works like Warp staff in multiple Fire Emblem games. Its usage in Dark Deity 2 is less dominating but a very strong effect regardless, capable of clearing objectives much faster within time constrain. Allowing self-cast is a very strong effect allowing for self-blink shenenigans.<br/>Ancient Writ is the only skill in this game that refills mana by a significant amount, providing a lot of utility plays.Best targets of this skill include units equipping the Attuned ring, or refreshed units that are low on mana and still have their action left for the turn. Reducing mana cost is the best upgrade to allow more usage of the skill. Increasing mana gained from the skill and debuff removal are nice to have upgrades when needed.",
    "Tips": "Scholar has decent stats for combat and decent Mas for skill usage, as well as a good supportive skillset. Player can use is more as a combat class or solely focus on using its skills as a support. None of the Summoner classes are as great a combatant as top tier combat classes such as Ascendent, Reaper or Slayer, so players should not put too much expectation into combat Scholar.",
    "Rings": "Scholar would enjoy rings that boosts skill performance like Lava, Mystic and Heir ring. Charged ring is also great for more skill usage. <br/>If player wishes to make the unit more combat focused, Bloodied and Advanatge ring are good options. Surefire ring is also a good choice to boost Scholar's lackluster Acc by its decent Mas stat.",
    "Weapons": "",
    "Class": "Scholar naturally progresses into the Loremaster class, which is also a supportive class with some decent combat. Nothing particularly of interest in terms of chemistry and synergy happens between the two classes.<br/>Cosmician is a great class for any tier 2 Summoner classes with great skills. It will boost the Skill num of Scholar skills to great heights."
  },
  {
    "ID": 13,
    "Classline": "Shaman",
    "Tier": 2,
    "Name": "Juggernaut",
    "Rating": [4, 4, 2, 3, 3],
    "Stats": "In terms od stat modifiers, Juggernaut is really strong with no negative modifiers, and a good HP and Lck modifier. Growth-wise Juggernaut has good HP, Mgt and Def, decent Frt and Lck, not so good Dex, and bad Spd and Mas growth.<br/>Juggernaut is the tank class for tier 2 Shaman line, has great Bulk in both spectrum, ok Pwr and Crt but below average Acc and Ddg, as well as bad TSpd and Skill num.",
    "Character": "None of the characters you have starts off in this class. Base on growth, Khamari will have the highest Def and Frt growth, as well as great HP growth. Coupling with his passive, he should have the best Bulk in game during the early-mid game. He also have good Mgt and passable Dex and Lck, but his SPd and Mas are rather lackluster.<br/>Laurai has same Def growth as Khamari, and even higher HP growth, making her a stronger Physical tank, but her Frt is weak and Spd is lacking, so she will have problem taking on fast Magical attackers. Shehas great Mgt for combat but her Mas is low so her skills are not as effective.<br/>Haoran will have the highest Mgt and Mas growth amongst te four, he also have great defense growth and an ok HP growth, allowing Haoran to tank some damage. Haoran will however, have low Spd and Lck, making him unable to double or crit reliably.<br/>Cassandra will transit smoothly due to retaining her Axe and having balanced growth. She will not be suffering from any area in particular other than her questionable Spd, but does not excel in any particular area either.",
    "Upgrade1": ["Low", "Top", "Mid", "Mid"],
    "Upgrade2": ["High", "High", "High", "Mid"],
    "Skills": "Juggernaut's passive gives mana to unit whenever it takes damage, which works well with the class's strategy of being on the front line and tanking damage, though in lower difficulties, the class's high defenses may become anti-synergetic with its passive as it can tank hits with no damage at all.<br/>Absorb Pain is a powerful support against debuffing enemies, though it is somewhat situational. The heal is nice to have but the primary goal is to remove debuffs from the unit itself and nearby allies. Increasing the range makes the skill much more useful and should be a top priority upgrade. This is skill is usually used to clear Juggernaut's own debuff though, providing some nice healing.<br/>Wreathed in Flame is the signature ability of Juggernaut and works immensely well with Repulsor Shield for easy kills during enemy phase. Note that it only triggers when the enemy unit is not killed at the end of the turn, and does not require the enemy to hit. Multiple stacks of this skill will combine their damage and be exahusted simultaneously even if only one instance has enough damage to kill. Duration increase and cost reduction are both great upgrades as players would want the skill to affect as many enemies as possible.",
    "Tips": "Juggernaut is a tank class with good stats to back it up. It also has skills that synergies with taking hits, and thus is probably the best receiver for Ageis's Repulsor Shield skill. It is also self-sufficent with a self heal and debuff-cleanse. Juggernaut should be spamming Wreathed in Flame and be at the frontline tanking as much damage as possible, though players need to be careful not to let Juggernaut's HP falls too low on higher difficulties.",
    "Rings": "Juggernaut prefers rings that increases its Bulk, so Indomitable, Hollowed and Dauntless rings are all great. <br/>Plague ring is decent combination to Wreathed in Flame for higher end of turn damage, and Solemn ring is a niche choice as it can provide damage reduction at times. Losing dodge for Juggernaut is not a big issue as the class does not dodge very often in the first place.",
    "Weapons": "",
    "Class": "Juggernaut naturally progresses into the Dreadnought class, which is similiarly built as a tank class, and has a passive that patches up the low accuracy the classline has, which is perfect for the inaccurate tank. All other classes generally do not need the growths or skills from Juggernaut."
  },
  {
    "ID": 14,
    "Classline": "Shaman",
    "Tier": 2,
    "Name": "Waveseer",
    "Rating": [3, 1, 5, 0, 3],
    "Stats": "Waveseer has very high and low stat modifier. The class has very good Spd and Mas modifier, but HP, Mgt and Def modifier are very negative. In term of growth, Waveseer has good Spd, Frt and Mas growth, and mediocre to low growth in all other area.<br/> Waveseer is a class focusing on Spd and Mas with decent Magical bulk, but not a very good combat class. The class has good TSpd and Ddg, as well as decent Mas, not very good Bulk, Acc and Crt, and an especially low Pwr rating.",
    "Character": "Amongst the four units capable of going into the Waveseer class, Haoran starts off as a Waveseer. He has the highest Mas amongst the four but the lowest HP, He has decent stat growths in all other areas except Lck. He is a good support unit with Skills but not very good at combat due to low HP and Crt.<br/>Cassandra and Laurai will have great Spd growth. Cassandra will have good Mas and Frt, but will not be a good combat class due to low Mgt and Dex. Laurai has good HP and better Mgt, Dex and Def than Cassandra, but will have lower Frt, Mas and Lck, making her better at combat but has worse Skill num than Cassandra.<br/>Khamari will have decent Bulk and TSpd as Waveseer, but his combat and Skill num are all not very impressive. Waveseer Khamari compromises his Bulk to receive some increase in Spd, this will hinder his usual gameplay.",
    "Upgrade1": ["Low", "High", "High", "Mid"],
    "Upgrade2": ["Mid", "Mid", "Mid", "Mid"],
    "Skills": "Waveseer's passive is one of the strongest in the game, providing a 30% mana cost reduction to all active skills the unit has, even their personal and tier 3 class skills. It is extremely useful for any unit or class that uses a lot of skills throughout the battle, and remains somewhat useful for all other classes as long as there is any skill usage.<br/>Healing Wave is a nice healing move that can heal multiple units at once. It is not very strong in term of Skill num but provides more than enough most of the time. Increasing target for this skill also increases the skill's range and player does not need a target adjacent to unit to use this skill. If target reaches 4 for example, the unit can simply just heal one unit in a line 4 tiles away even if there are no allies in between.<br/>Whirlpool is a niche utility skill that can either trap units within or block enemies from passing through it. It is great for buying time or preventing too many enemies from engaging a certain unit of yours. It has a hig mana cost, but is actually offsetted by Waveseer's own passive. Increasing in duration can compound with Aqua ring to give a total of 3 turns of effect.",
    "Tips": "Waveseer is a support focused class with good Spd as a bonus. It is an option for combat focused class to go into before promoting into tier 3 if the unit wishes for maximum Spd. Otherwise, Waveseer is pure support and all stats bar Mas do not matter much.",
    "Rings": "Waveseer focuses on support skills, so Charged ring is a good choice. Aqua ring affects both Whirlpool and Healing Wave and can be considered for increasing effect, though note that Aqua ring affects Healing Wave's target number, not healing number, and only has an effect on Whirlpool if player has upgraded the Duration first.<br/>As a healing unit, rings that enhances heal are also great choices. Lifebringer ring is probably the best for Waveseer as not only it boosts Healing Wave it can also enhance the healing skills of all Shaman units. Prophet and Brightening rings provide healing target additional stats which can be useful for their combat, giving Waveseer more support options, while Sacred ring is a good way for Waveseer to heal itself while using skills frequently.",
    "Weapons": "",
    "Class": "Waveseer naturally progresses into the Tidecaller class. Tidecaller is also a support class with great Spd but terrible combat.The classline has good Skill num and unique skills that are very useful for many occassions and thus player will find good use for Waveseer's passive.<br/>Hemomancer is the more combat focused class of Shaman classline. While Hemomancer would prefer Ritualist's class skill set, going into Waveseer first for more Spd is also very welcomed by Hemomancer.<br/>Spirit Keeper would also appreciate Waveseer, partially because the higher Spd growth of Waveseer can prevent Spirit Keeper from being doubled by many enemies, but also because the passive cost reduction allows for more uses of Spirit Keeper's high cost skills."
  },
  {
    "ID": 15,
    "Classline": "Shaman",
    "Tier": 2,
    "Name": "Elementalist",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "Elementalist has good Mgt, Dex and Mas modifier, but negative HP, Def and Lck modifier. In terms of growth, Elementalist focuses on Mgt, Dex and Mas, and also has a decent Frt growth modifier. Its growth in HP, Spd, Def and Lck are  all terrible.<br/> Elementalist is a mixed class that has decent Pwr and Acc for combat, and good Skill num for skills. However, its poor TSpd and Crt will hold it back from being a full fledged combat unit, and its terrible Bulk prevents it from going into the front line.",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 16,
    "Classline": "Shaman",
    "Tier": 2,
    "Name": "Ritualist",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 17,
    "Classline": "Adept",
    "Tier": 2,
    "Name": "Gale",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 18,
    "Classline": "Adept",
    "Tier": 2,
    "Name": "Conduit",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 19,
    "Classline": "Adept",
    "Tier": 2,
    "Name": "Frigillan",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 20,
    "Classline": "Adept",
    "Tier": 2,
    "Name": "Monk",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 21,
    "Classline": "Vanguard",
    "Tier": 3,
    "Name": "Reaper",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 22,
    "Classline": "Vanguard",
    "Tier": 3,
    "Name": "Ancarant",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 23,
    "Classline": "Vanguard",
    "Tier": 3,
    "Name": "Ellisant",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 24,
    "Classline": "Vanguard",
    "Tier": 3,
    "Name": "Champion",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 25,
    "Classline": "Hunter",
    "Tier": 3,
    "Name": "Warden",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 26,
    "Classline": "Hunter",
    "Tier": 3,
    "Name": "Slayer",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 27,
    "Classline": "Hunter",
    "Tier": 3,
    "Name": "Beastmaster",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 28,
    "Classline": "Hunter",
    "Tier": 3,
    "Name": "Deadeye",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 29,
    "Classline": "Summoner",
    "Tier": 3,
    "Name": "Cosmician",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 30,
    "Classline": "Summoner",
    "Tier": 3,
    "Name": "Necromancer",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 31,
    "Classline": "Summoner",
    "Tier": 3,
    "Name": "Relic Knight",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 32,
    "Classline": "Summoner",
    "Tier": 3,
    "Name": "Loremaster",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 33,
    "Classline": "Shaman",
    "Tier": 3,
    "Name": "Dreadnought",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 34,
    "Classline": "Shaman",
    "Tier": 3,
    "Name": "Tidecaller",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 35,
    "Classline": "Shaman",
    "Tier": 3,
    "Name": "Spirit Keeper",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 36,
    "Classline": "Shaman",
    "Tier": 3,
    "Name": "Hemomancer",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 37,
    "Classline": "Adept",
    "Tier": 3,
    "Name": "Tempest",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 38,
    "Classline": "Adept",
    "Tier": 3,
    "Name": "Stormkeeper",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 39,
    "Classline": "Adept",
    "Tier": 3,
    "Name": "Godfrost",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 40,
    "Classline": "Adept",
    "Tier": 3,
    "Name": "Ascendant",
    "Rating": [1, 1, 1, 1, 1],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  }
]
