[
  {
    "ID": 1,
    "Classline": "Vanguard",
    "Tier": 2,
    "Name": "Devoted",
    "Rating": [4.2, 5.6, 2.2, 4.8, 5.5, 4.5],
    "Stats": "Devoted is a class focusing on Mas and Lck, with high modifier and growth in these two areas. Other than Mas and Lck, Devoted also has decent mod and growth in Dex and mediocre numbers in Mgt and Spd. The defensive stats of Devoted are horrendous, with mediocre HP growth, and abysmal growth in Def and Frt.",
    "Character": "Amongst the four units capable of going into the Devoted class, Vissarion starts off as a Devoted. He also has the highest total growth amongst them. He will have extremely high HP and Mas growth, good Dex and Def and decent Mgt and Lck.<br/> Benji as Devoted will have the highest Mgt and Lck, making him an excellent Crit damage dealer, it will also give him slightly better Dex and Mas growth. He will also have passable bulk, making him a good choice for Devoted. <br/>Valeria will have decent Spd growth and great Dex and Mas, but her stats in other areas will be mediocre. <br/>Gwyn as Devoted has good HP, Mas and Lck, ok bulk mainly due to high HP growth, and decent growths in other areas.",
    "Upgrade1": ["Mid", "Low", "Mid", "Mid"],
    "Upgrade2": ["High", "Low", "Low", "Mid"],
    "Skills": "Devoted's passive boosts unit's Crit chance if enemy is inflicted with a debuff. However, Devoted only can apply 1 kind of debuff on its own, and none of the Vanguard units have a personal skill that applies debuff either. So Devoted has to either be content with 1 stack of passive, go into a tier 3 class that provides debuffs, or relies on teammates help.<br/> Spinning Blade is a skill that boosts Devoted's bulk by quite a bit. While it is not very synergetic with Devoted's dodgy not bulky stats, it does have good numbers due to Devoted's high Mas. It provides a nice defensive boost in case Devoted need to face a counter attack. It also can serve as a debuff cleanser in higher difficulties when debuffs starts to hinder Devoted's combat capabilities.<br/> Hemorrage is the synergetic skill Devoted can use to boost Crit chance together with appling Bleed to enemey, further increasing damage outcome. It is recommended to go for the cost down upgrade in order to apply debuff more readily, giving Devoted higher Crit chances.",
    "Tips": "Devoted is a combat class with good Mas and crit chance. It has decent combat and dodge, and mediocre bulk. Its Hemorrage skill offers some debuff that can either combo with its own passive or weaken enemies for allies. <br/>However, its combat is hindered by its mediocre Mgt and middling Spd, making Devoted dealing less than ideal damage if the critical did not happen. Its skills are also not very synergetic as Devoted is a class with better Dodge than Bulk, but has a skill that boosts Bulk instead of Dodge.",
    "Rings": "Rings providing extra critical are the best for Devoted: Dominator and Destiny ring are good. Rings that increases combat damage like Bloodied ring can also be considered.",
    "Weapons": "Axe and runes",
    "Class": "Devoted's natural progression is Reaper, a highly synergetic class as Reaper also focuses, if not more focused, on Critical chance and damage. Devoted's Crit chance boost would be useful if enemy is debuffed.<br/> Ancarant is a decent choice for Devoted to go into due to having a skill that can apply up to 2 debuffs to enemies, giving Devoted 3 stacks of its passive."
  },
  {
    "ID": 2,
    "Classline": "Vanguard",
    "Tier": 2,
    "Name": "Nightblade",
    "Rating": [3.9, 6.7, 2.6, 4.0, 8.0, 6.0],
    "Stats": "Nightblade is a Spd focused class with good Frt as well. The class has good stat modifier in Spd and Frt, as well as decent Dex and Lck, modest Mas, but terrible modifier in HP, Mgt and Def. <br/>In term of growth, Nightblade similiarly excels in Spd and Frt, and also sport a decent Mas growth. Dex growth is also decent but Lck growth is mediocre. The class's growth in HP, Mgt and and Def are poor.",
    "Character": "Amongst the four units capable of going into the Nightblade class, Valeria starts off as a Nightblade. She also has the highest Spd, Dex and Frt growth amongst them. Nightblade will bring out the stength and weakness of Valeria, making her one of the fastest unit in the game, a great dodge tank and magic enemy killer, with good Acc and Skill number, but bad physical bulk and very low damage dealt at base. <br/> Benji is the opposite of Nightblade, which makes Nightblade a great complement class for him if he wish to patch up his Spd, making him a good all-rounder combatant. <br/>Gwyn will have good Spd, Mas and Frt, stats that she may want to bring into her tier 3 class choice, similiar to Vissarion, but low HP and Mgt maybe a concern if they wishes to be a bulky unit or high damage dealer.",
    "Upgrade1": ["High", "High", "Low", "Mid"],
    "Upgrade2": ["Low", "Mid", "Mid", "Top"],
    "Skills": "Nightblade is a dodge tank class, and its skills capitalise on this further. Nightblade's passive increases the class's Ddg further if you use skills continuously, up to 40%, making enemy hit rate well below 40% with ease. <br/>The active skills complement this even further, Grim Stroke applies Poison to enemy, decreasing their Acc further for even more \"Dodge\" on unit, as well as decreasing enemy's Def to boost Nightblade's otherwise lackluster damage output. On lower difficulties, it is better to decrease its mana cost to allow more uses of te skill as consective usage of skills is essential to keep up Nightblade's Ddg passive. On higher difficulties, it is useful to give it extra range as Nightblade can better support other damage dealers instead of having to deal the damage itself.<br/> Fleet Feet increases Spd of target, which also in turn increases Ddg. If the skill is applied to self, it is not uncommon for Nightblade to just receive 40 Ddg instantly off this skill alone. It is essential to get the self-cast buff for this. Increased duration is also decent way to keep up the Ddg just in case there is a break in skill usage. ",
    "Tips": "Nightblade is a good utitlity unit that is great in many areas. It is a great dodge tank in game, capable of doubling most enemies in combat. Poison is the strongest debuff in game and increasing Spd is a rare yet powerful buff to have. Nightblade's base Dodge is not as impressive as some of the other speedy classes, but its skills more than make up for it, making its Dodge much better than what appears here at base.<br/>Nightblade does have the issue of low Mgt, which coupled with its low Lck and thus Crit, make Nigitblade struggle to one round enemies despite almost guaranteed double. Poison from Grim Stroke is a great help, but Nightblade would still need more forms of damage boost to truly excel.",
    "Rings": "Nightblade is a dodge-centric class, thus any Ddg increasing rings are appreciated. Depth and Diplomat rings are the first to come to mind, but Nightblade's low Mgt and thus kill power makes them less than ideal. Drunkard is a decent choice, as it provides good Ddg if Nightblade's skills are not active, and a decent failsave even if they are. Damage boosting rings are also great for boosting Nightblade's power. <br/>Advantage ring gets a special mention as Nightblade has great Spd and good Mas, good Mas means the ring is more effective, and good Spd means Nightblade can double and take advantage of the damage boost twice per round of combat.<br/> Charged ring is also an interesting choice as it provides more mana generation and can sustain Nightblade's skill usage longer.",
    "Weapons": "Daggers and runes",
    "Class": "Nightblade naturally progresses into Ancarant class, which is a good fit as Ancarant is also a dodge tank class, with passive that synergies really well with Nightblade's passive and active skills.<br/> Champion is not a great class, but Nightblade can provide the Spd growth for Champion to avoid getting doubled by the slower enemies, as well as more Frt for better bulk. <br/>Reaper and Ellisant do not particularly need Nightblade, but the extra Spd is always welcomed regardless."
  },
  {
    "ID": 3,
    "Classline": "Vanguard",
    "Tier": 2,
    "Name": "Seeker",
    "Rating": [5.6, 3.2, 2.8, 4.9, 3.0, 8.0],
    "Stats": "Seeker is a class focusing on Dex and Mas, as well as good Mgt. Its HP, defenses and Lck modifiers are 0 or 1, and a negative in Spd modifier. Its growth are similiar with a focus on great Mgt, Dex and Mas, a surprisingly decent Def growth, subpar HP, Frt and Lck growth, and lastly a bad Spd growth.",
    "Character": "None of the characters you have starts off in this class. Base on growth, Vissarion probably fits the most as he has the highest Mas and joint highest Dex and better Mgt than Valeria who also has the joint highest Dex growth. Vissarion also sports a good physical bulk for safer combat scenario although low Spd and Frt makes tanking not desirable. <br/>Benji will probably be the best damage dealer amongst the four as a Seeker with a balanced mix of Mgt, Dex, Mas and Lck, while Gwyn is decent overall with acceptable growth in all areas except maybe Spd.",
    "Upgrade1": ["Mid", "Mid", "Mid", "Low"],
    "Upgrade2": ["Mid", "Low", "High", "Mid"],
    "Skills": "Seeker's passive applies a debuff on enemy, making it easier for your teammates to kill that turn. It is handy and fits into Seeker's role as a chip damage dealer. <br/>Illuminate gives more Acc to self or teammates, a skill more inclined to higher difficulty settings where Acc at base are less reliable. Increasing duration is a nice boost as it turns Illuminate into a 25 cost 3 turn skill. Increasing range and allowing self-cast gives the skill more flexibility in Seeker's positioning. <br/>Enchant Weapon is the core skill for Seeker, providing a decent damage boost to the unit's own attacks. Casting it again before the effect from the first cast runs out will increase the duration further, but not further increasing the damage dealt. Increasing duration is better in terms of cost efficiency compared to cost reduction, but both can picked for maximum efficiency. If debuffs are an issue for you, clearing target debuff is a decent choice.",
    "Tips": "Seeker is a class that has good combat and decent bulk. Thanks to Enchant Weapon, Seeker's combat is stronger than what its base suggests, and is a useful skill to be carried over to any of Vanguard's tier 3 classes.<br/>However, Seeker is a 2 range locked unit incapable of attacking at 1 range, so players need to be careful where to put Seeker. Seeker also has low Dodge and Spd, meaning it is likely to get doubled by the enemy and unable to dodge any attacks.",
    "Rings": "Seeker would prefer some damage boost or skill number boost. Bloodied ring is a decent choice to boost Seeker's combat capability, providing not only Pwr but valuable TSpd and Crt boost, allowing Seeker to double some enemies in the early-mid game.<br/> Blazing ring is a nice option as the 50% damage boost it provides stacks multiplicatively with Enchanct Weapon.<br/> Mystic or Lava ring can also be used as enhancing the effect of Enchant Weapon can be very beneficial for Seeker.",
    "Weapons": "",
    "Class": "Seeker naturally progresses into Ellisant class. Ellisant allows unit to safely attack enemy from very long range, similiar to how Seeker can chip down enemies at a distance. Seeker's Enchant Weapon is also useful in giving Ellisant more damage.<br/> Other than Ellisant, Seeker can also provide useful damage boost to Ancarant or Reaper, but mana cost and class passives are less syerngetic than their natural counterparts."
  },
  {
    "ID": 4,
    "Classline": "Vanguard",
    "Tier": 2,
    "Name": "Gallant",
    "Rating": [6.8, 3.2, 2.2, 4.5, 2.0, 6.0],
    "Stats": "Gallant has a high HP modifier and good Mgt modifier. All of its other modifier are very moderate. In terms of growth, Gallant focuses on HP, Mgt and Def, with decent Dex and moderate Mas. Its growth in terms of Spd, Frt and Lck are abysmal.",
    "Character": "All four characters that have access to Gallant class will have absurdly high HP growth. Benji starts off naturally in this class, and has highest Mgt and joint highest Def growth. It is a min-max class that sacrifices Spd and Mas, as well as very mediocre Dex, Frt and Lck, for HP, Mgt and Def. <br/>Vissarion with his personal growth is even more min-max, with much better physical bulk, but even lower Frt and Lck. His Spd is still bad but he does get respectable Mgt, Dex and Mas. <br/>Valeria becomes a more balanced unit in Gallant, having good Mgt and still decent Spd, good overall Bulk and decent Dex and Mas, but her Lck growth will be butchered completely.<br/> Gwyn makes a great combatant in Gallant too, having high HP, Mgt, Def and decent Dex and Mas. Nothing is too terrible about Gallant Gwyn except slightly subpar Spd, Frt and Lck. ",
    "Upgrade1": ["High", "Mid", "High", "Low"],
    "Upgrade2": ["Low", "Mid", "Low", "Low"],
    "Skills": "Gallant's passive is a decent damage boost against enemies at full HP. It allows Gallant to have more OHKO potential, or simply deal more damage when it opens up a path amongst enemies. The condition is lenient enough and can still work even after enemies have been chipped. <br/>Call to Arms is the more useful skill for Gallant, providing a nice damage boost to all allies within range. Increasing its duration is very useful especially if you are not moving much for next turn, though just 1 more turn is usually good enough. <br/>Overpower is a weird skill as Gallant is a 1 range unit, pushing enemies away from Gallant seems counter-productive. It can be used to push allies butthe debuffs goes to waste. It can also be used to apply debuffs to enemies who cant be moved, but that is a waste too. Overall a weak and anti-synergetic skill not worthy most of the time.",
    "Tips": "Gallant is a physical powerhouse with good tanking potential on the physical side. The class has good damage and useful support in the form of Call to Arms. Overpower is a positioning tool that also has a debuff which may come in handy. <br/>However, Gallant is a slow class with poor Frt, making it vulnerable to fast Magical enemies like Magi or Witch, which can double Gallant, dealing huge damage. Gallant also has low Mas and weak skill numbers, making its skills not very effective.",
    "Rings": "Bloodied ring is always a good choice for combat focused class, not an exception for Gallant. <br/>Blazing ring will also stack with Gallant's passive and Call to Arms, making it a decent choice. <br/>Tranquility, Dauntless, Guardian, Indomitable and Dimming are all possible options if you wish to boost the bulk of Gallant. Equilibrium is also an option if you find Gallant's low Frt a crippling issue.",
    "Weapons": "",
    "Class": "Gallant naturally progresses into Champion class, a class that also focuses on raw Pwr and combat damage. It is a good fit for Gallant.<br/> However, Gallant also would do well going into Reaper, as Reaper's passive condition conincides with Gallant's and can result in good damage."
  },
  {
    "ID": 5,
    "Classline": "Hunter",
    "Tier": 2,
    "Name": "Ranger",
    "Rating": [6.0, 4.4, 3.0, 4.7, 7.5, 1.0],
    "Stats": "Ranger has good stat modifier in HP and Mgt, and bad in Dex, Frt and mostly Mas. Growth wise Ranger has good growth modifier in HP, Mgt and Def, its Frt growth is bad and Mas growth is terrible. Its growth in Spd, Dex and Lck are mediocre.",
    "Character": "Amongst the four units capable of going into the Ranger class, Tusk starts off as a Ranger. He has monstrous HP growth as Ranger, as well as great Mgt and Def. His other stats are mediocre, and Frt and Mas growth are atrocious, a typical tank build. <br/>Zanele will have decent bulk as Ranger, having good Mgt too. However it is not recommended as her personal skill will be rendered much less effective due to low Mas. <br/>Eve is also not recommended as a Ranger as while her bulk and Mgt are decent, her Spd will take a hit making her double less enemies.<br/> Riordan has great bulk and Mgt too as a Ranger, and have decent Mas and Lck too. His Spd and Dex will become an issue but if looking pass those Riordan will make a great Ranger.",
    "Upgrade1": ["Low", "Low", "Mid", "High"],
    "Upgrade2": ["Mid", "Mid", "Mid", "Top"],
    "Skills": "Ranger's passive gives itself more Bulk when it falls below half HP, and can trigger again if Ranger is healed above half HP and then falls below the threshold again. It is extremely powerful early game and secures Ranger as the best tank early game. It can even tank Magical attacks decently as Block will reduce Magical damage as well.<br/> Lanky Spanky does not have a Mas scaling to it, which is not a bad thing considering Ranger's low Mas. Stack increase is actually duration increase here, which can buy valuable time for your units to deal with threathening enemies. Stun in this game is not as mighty as other iterations as it does not stop the stunned unit from countering enemy attacks, but is still useful to stop them from attacking you during enemy phase.<br/> Command Orangutan is a standard Hunter class Red skill which is essentially a normal attack with an extra skill damage and effect attached. Exhaustion is just an ok debuff, but does help against dodgy enemies like Rogue, Witch or Sellsword. Mana cost down and increased stacks are all nice bonuses, but the healing is the more useful upgrade here, as Ranger is a tank unit with no healing outside of this. Healing will not only increase the longevity of Ranger, but can also bring Ranger above half HP threshold to potentially trigger its passive again.",
    "Tips": "Ranger is one of the best tank class in the early game thanks to its great Bulk, and a passive that boosts its Bulk even further when situation gets dire. Ranger is also good at dealing high damage, and also has a Stun from Lanky Spanky that can go up to 3 range for enemy debuff.<br/>Ranger is weaker in terms of Magical bulk, and its slow Spd will make matters worse. Ranger's passive will mitigate the issue but player still needs to be careful. Ranger will also fall off as game progresses due to the flat bonus provided by its passive not scaling, so player should consider promoting Ranger early when possible.",
    "Rings": "Ranger should focus on increasing its Bulk to tank better. Tranquility, Dauntless, Hollowed, Guardian, Indomitable and Dimming are all possible choices. Guardian is synergetic with Ranger's passive to give Ranger more Bulk when below half HP, and Dimming can remove Ranger's ineffective Mas stat to provide further boost to defenses, though due to Ranger's low Mas, the boost will be small. ",
    "Weapons": "",
    "Class": "Ranger naturally progresses into Warden, which is also the most synergetic tier 3 class for Ranger. Warden is a tank class with better stats and another passive than further boosts Def, picking up in terms of Bulk while Ranger alone is falling off.<br/. Ranger's overall skill effects are not impressive, and thus is generally not considered if Warden is not the tier 3 class of choice."
  },
  {
    "ID": 6,
    "Classline": "Hunter",
    "Tier": 2,
    "Name": "Cutthroat",
    "Rating": [4.1, 7.4, 5.9, 4.7, 7.0, 8.0],
    "Stats": "Cutthroat's stats focuses on Spd and Lck, with a little stat boost to Dex and Frt, as well as slightly negatively impacts HP, Mgt and Mas. In terms of growth, Cutthroat has bad HP, Mgt and Frt growth modifier, as well as atrocious Def, but it excels in Spd, Dex and Lck, and has ok Mas growth. ",
    "Character": "Amongst the four units capable of going into the Cutthroat class, Eve starts off as a Cutthroat. She is also the most aligned in terms of growth. Eve has the single highest Spd growth in the entire game as a Cutthroat, with insane Lck growth to boot. Her HP growth is actually not terrible either, but her defense are quite low. She also has low Mgt and Mas growth, which prevents her from being a perfect unit.<br/> Zanele is also quite fast as a Cutthroat, and slightly better growth in most other areas compared to Eve other than HP, most notable is her high Mas growth which Eve lacks. However, Zanele does suffer from a low Lck growth, which is anti-synergetic with Cutthroat's passive, making her not as compatible with the class compared to Eve. <br/>Tusk can be quite a fast and strong combatant as a Cutthroat, with his passive essentially providing more Spd. His Ddg is nowhere near as impressive as Eve's but with his monstrous HP and better Def it is not a bad combination. <br/>Lastly, Riordan has the best total growth, but will have a more balanced spread across the board. Cutthroat Riordan will not be a bad unit, but will be less ideal than the other specialists out there.",
    "Upgrade1": ["Top", "Mid", "Top", "Mid"],
    "Upgrade2": ["Mid", "Mid", "High", "Low"],
    "Skills": "Cutthroat's passive is one of the most powerful and synergetic passive in the game, utilising the class's high Lck to push Ddg to insane level. Cutthroat does not have the highest Ddg in game at base, but with passive it becomes the highest Ddg in game by far, possibly only matched by Nightblade with 2 stacks of Shadowstep.<br /> In term of active skills, Licky Lasso is yet again one of the best Blue skills in game, being able to drag enemies towards you at a distance. You may use this skill to drag in bosses from far away towards you and end the chapter much earlier. Increasing range is the best option as it is unlikely to increase much otherwise due to Cutthroat's relatively low Mas.<br /> Command Toad is a more standard Hunter class Red skill that often gets overlooked in favour of Lick Lasso. It offers Poison debuff, the strongest type of debuff in the game, which can boost Cutthroat's relative lower damage instance. Increasing the number of stacks is very effective due to how Poison works in this game. Healing is unnecessary as Cutthroat as a dodge tank seldom takes any damage.",
    "Tips": "Cutthroat is a great dodge tank, with a passive that boosts its Dodge even further, making the class almost untouchable. Command Toad offers valuable Poison debuff to enemies, which can either boosts Cutthroat's own damage or help allies secure a kill. Licky Lasso is a extremely powerful repositioning tool that works on both enemies and allies, making Cutthroat extremely deadly at a distance despite its own attack range of 1. <br/>Cutthroat does not have much weakness as its 1 range attack is mitigated by Licky Lasso, its poor Bulk by its high Dodge from high Spd, Lck and passive, and its mediocre Mgt by Command Toad's Poison. However, Cutthroat still have low Mas, making its Skill num not as great as it can be, so when the situation calls for it, Cutthroat's skills usually do not offer much more than what it already has at base.",
    "Rings": "Rings providing extra Ddg is good for Cutthroat: Depth and Diplomat rings are recommended. Drunkard is okay but less recommended due to innate high Ddg of Cutthroat diminishing its effectiveness.<br/>Cutthroat can also take advantage of Farseer ring as Licky Lasso has 2 range increasing upgrades, essentially gaining +4 Range with Farseer ring and upgrades.",
    "Weapons": "",
    "Class": "Cutthroat naturally progresses into Slayer, which is also a good dodge tanker class. Slayer is a great 1-2 range class and has a passive to boost damage output, one thing Cutthroat lacks, making Cutthroat/Slayer one of the best in the game. <br/>Deadeye is also a great choice as it is also a fast class with decent Lck. Deadeye also has better Mgt and Mas, making Cutthroat/Deadeye is clas with both good Pwr and Ddg. The disadvantage other than having less Crt is that Deadeye is a 2 range only class, decreasing its enemy phase potential. <br/>Beastmaster and Warden are slow classes that will be balanced out by Cutthroat's growth, but is otherwise not recommended."
  },
  {
    "ID": 7,
    "Classline": "Hunter",
    "Tier": 2,
    "Name": "Tamer",
    "Rating": [6.5, 3.1, 4.2, 3.8, 7.0, 5.5],
    "Stats": "Tamer is a class focusing on HP and Mas, with very high modifier in these two stats, but bad modifiers everywhere else. In terms of growth, Tamer has good HP growth and an impressive 40% in Mas. Its Mgt, Def and Frt growth are also decent, and Dex growth is ok. However, Tamer's Lck and Spd growth are terrible.",
    "Character": "None of the characters you have starts off in this class. Zanele is usually most recommended in this class due to her extremely valuable and unique personal skill. Tamer's growth in combat related stats are secondary, it is the best at providing highest Mas growth on par with Cosmician to give units extremely effective skills.<br/>Tusk is an interesting choice with a monstrous HP growth exceeding 100%, with the potential to get 3 HP in a single level up. His Mgt and Mas growth are both great, making his personal skill extremely heavy hitting. However, Tusk's personal skill and Tamer's skill will coincide in terms of effect.<br/>Riordan has surprisingly good growth spread with Tamer, giving him very good HP, Def and Frt and excellent Mas. While neither Riordan nor Tamer's skills are particularly impressive, the combination of highest total growth unit and tier 2 class makes Tamer Riordan a titan in terms of stats.<br/>Eve will receive balanced growth in Tamer class, but having no stats standing out is not great for Eve. Eve's personal skill is also not worthy of going into Tamer and give up powerful alternatives like Cutthroat.",
    "Upgrade1": ["Mid", "Mid", "Mid", "Low"],
    "Upgrade2": ["Low", "Low", "High", "Mid"],
    "Skills": "Tamer's passive is extremely synergetic with the core idea of the class: dealing huge damage with pet commands, adding more Mas scaling to Pet commands, in a class  with high Mas growth and sta modifiers. Do note that only the Red skills are considered Pet Commands and the Blue ones do not get affected by this passive. <br/>Call the Pride is a decent support skill giving Light Block to teammates, boosting their Bulk slightly. Its cost is expensive and only last 1 attack per unit. It is usually used as an emergency measure rather than common use. Decreasing its cost or increasing total stacks given is usually prefered. <br/>Command Lion is a Red skill and boosted by Tamer's passive, essentially making it 125% Mas scaling before upgrade. Unlike most other Pet Commands, this one has no secondary effects and instead have high Mas scaling, something Tamer likes. Increasing its scaling further is highly effective, and allowing the skill to heal can be helpful as Tamer has high HP but not too high defenses or far range, thus may be lacking a large portion of HP very often.",
    "Tips": "Tamer is very strong at dishing out damage using its Red skill or Pet Command. With high Mas growth and a passive that increases the scaling even further, Tamer is easily capable of dealing the highest skill damage amongst all tier 2 classes. Players should capitalise on this and let Tamers delete high Def enemies like Lancers or Overseers as skill damage deals fixed damage.<br/>At base, Tamer will have some of the worst combat performance, with poor Spd and Lck that makes it hard for Tamer to double or Crit, and mediocre Mgt and Dex. While Tamer has excellent HP, its Def and Frt are poor, and with slow Spd making Tamer vulnerable to getting doubled, its decent Bulk might look illusional. Players should avoid throwing Tamer into direct combat, especially on enemy phase, despite Tamer having 1-2 attack range.",
    "Rings": "Tamer is a Skill Num focused class, thus Mystic and Lava rings are extremely beneficial to Tamer. Lava ring is stronger and would be the most effective option, but Mystic ring is also very good and a great option if you have more than one unit focusing on skills. <br/> Mana related rings are also great. Companion ring specifically works for Pet commands and is probably the most synergetic ring with Tamer. Charged ring is similiarly useful, allowing more uses of Pet commands every battle.",
    "Weapons": "",
    "Class": "Tamer naturally progresses into Beastmaster, which is also a Skill num focused class, extremely synergetic with Tamer and should be the only viable option if the unit is built for Tamer already.<br/>However, A unit previously not in Tamer class can go into Tamer before promoting into any other tier 3 class if they want to utilise Tamer's passive for a boosted Pet Command."
  },
  {
    "ID": 8,
    "Classline": "Hunter",
    "Tier": 2,
    "Name": "Quickdraw",
    "Rating": [3.0, 6.9, 4.8, 7.5, 6.5, 1.0],
    "Stats": "Quickdraw focuses on Spd and Dex with slight positive Mgt stat modifier. It has a highly negative HP modifier and -1 in Def and Frt. In terms of growth, Quickdraw heavily focuses on Mgt, Spd and Dex, and has very bad growth in terms of HP, Def, Frt , Mas and Lck.",
    "Character": "Amongst the four units capable of going into the Quickdraw class, Zanele starts off as a Quickdraw. She has very high Spd, Dex, Mgt and Mas growth, but has mediocre HP, Def, Frt and Lck growth. This will make her a very capable combat unit, but does not utilise her special personal skill as effectively as Tamer.<br/>Eve will be just as fast compared to Cutthroat and will have better Mgt. However, her Ddg will be compromised without Cutthroat's passive, making it less than ideal as her bulk also gets worse.<br/>Riordan's high personal growth makes him a functional Quickdraw with decent bulk and great combat. However, he does have least Spd growth amongst all Hunter unit, something Quickdraw does not desire.<br/> Tusk is surprisingly capable as Quickdraw, as he will get good Spd growth together with high HP, Mgt and Dex. His physical bulk is impressive and magical bulk is bad but still managable, as most enemies cannot double him and will not defeat him easily through his huge HP pool.",
    "Upgrade1": ["Low", "Mid", "Low", "Mid"],
    "Upgrade2": ["Low", "Low", "Mid", "Mid"],
    "Skills": "Quickdraw's passive gives the unit 5 Mana if a follow-up attack is performed. It is not a very useful ability as follow-up attacks are not very consistent, possibly due to having to fight fast enemies Quickdraw struggle to double, or outright killing a weakened enemy without needing to follow-up. Enemy phase follow-up is also hard to do as Quickdraw is a 2 range unit. <br/>Wicked Cackle is an AOE debuff skill which applies Weak to enemies. it is a weird skill as Weak reduces damage dealt by enemy, something Quickdraw does not really utilise well as Quickdraw cannot tank and would prefer to outright kill enemies. It can help to support teammates if there are numerous enemies that player cannot take out in one turn but it is highly situational.<br/>Command Hyena is your typical Hunter Red Skill that deals extra damage in addition to a normal attack and applies a Bleed debuff, adding even more damage to it. It is essentially just more damage, something welcomed by a damage-centric class. Adding a heal for some utility or increase stacks for more damage is preferred.",
    "Tips": "Quickdraw is a combat focused class, with one of the best combat performance amongst tier 2 classes. Wicked Cackle's Weak and Command Hyena's Bleed debuffs are both damage increasing debuffs, which further increases Quickdraw's kill threshold. <br/>Qucikdraw is a 2-range locked unit with very poor bulk, so players should avoid enemy contacts during enemy phase. Quickdraw has has low Mas growth as well as low Mas scaling on skills, which means its skill effectiveness will struggle to keep up as game progresses.",
    "Rings": "Quickdraw would prefer rings that improves battle performances. Grip increase TSpd equals to half of weapon weight, which might be useful if you opt for heavy weapons. Kindling increases Pwr every time mana is spent, which can be useful to combo with Quickdraw's mana regen for more Skill usage.<br/> Crit increasing rings are also great due to Quickdraw's high Mgt and Spd, so Soulfire and Dominator can be considered. <br/>Finally, Archmage is an interesting pick as Quickdraw is a 2 range unit and its skills depend on attack range, which means it qualifies for the condition needed to trigger Archmage ring's effect, essentially giving Quickdraw 1 extra attack range.",
    "Weapons": "",
    "Class": "Quickdraw naturally progresses into the Deadeye class, with similiar stas and growths. It is also a good combat class and plays quite well. <br/>Slayer is a decent choice which is also fast, and has 1-2 range, which utilises Quickdraw's passive much better than Quickdraw itself or Deadeye, making it a great choice too.<br/>Warden and Beastmaster are too slow to utilise Quickdraw's passive, and Quickeye does not really have strong skill effects, and the classes would much rather have Cutthroat for better Spd growth."
  },
  {
    "ID": 9,
    "Classline": "Summoner",
    "Tier": 2,
    "Name": "Geomancer",
    "Rating": [5.0, 4.3, 9.1, 3.4, 2.5, 10.0],
    "Stats": "Geomancer is a class focuses on Mas and Lck. It has great stat modifier in Mas and Lck, and good modifier in HP and Def. Its Spd and especially Frt stat mod are negative. In terms of growth, Geomancer has great HP and Mas growth, decent Mgt, Def and Lck growth and low growth in terms of Spd, Dex and Frt.",
    "Character": "Amongst the four units capable of going into the Geomancer class, Calith starts off as a Geomancer. She has the highest Dex and Lck growth amongst all. She has good HP and Lck, but all her other growths are mostly mediocre, making her not so good interms of either combat or Skill num. <br/> Athur has the highest Mas growth and can get insanely high Mas for extremely powerful skills. He also will get good Mgt and decent Bulk, making his combat performance more tolerable. <br/> Alden will have high HP growth, good Def and Mas growth and decent Mgt and Frt. He will be a bulky unit with good Skill num. <br/> Finally, Aya will be more min-mix with good Mgt, Mas and Lck, decent HP, Dex and Def but mediocre Spd and poor Frt.",
    "Upgrade1": ["High", "Low", "Low", "High"],
    "Upgrade2": ["Low", "Mid", "High", "Mid"],
    "Skills": "Geomancer's passive is a slight buff to teammates. If more than 2 allies are within range, 2 will be buffed at random. The skill is nice to have in the early game but even then it is not strong. It quickly becomes quite irrelevant and not something players usually pay attention to due to the buff provided being too small. <br/> Starsurge is similiar to Rescue from Fire Emblem series but can also deal damage to enemies adjacent to target. The Rescue part is highly useful to get allies move long distance, but the damage is situational. Cost down to allow more usage is highly preferred, and range increase is very useful early game when Mas is still low. Caster healing is not recommended as it is rarely used to deal damage.<br/>Moonlight works similiar to Physics in Fire Emblem, and can heal allies from distance, making it an extremely useful healing option. Geomancer with its high Mas can usually heal allies from very far away. Range increase is useful early on and can be replaced later if seems redundant. Player can choose debuff removal if debuffs are prevalent, or give mana to target for better support.",
    "Tips": "Geomancer is a class focusing on good Skill numbers. Not only does it have good skill growth, but also good skill effects, though the effects are supportive and usually not offensive. If player wants good skill numbers later for their units, they can consider levelling up in Geomancer first. Starsurge and Moonlight are both extremely strong support skills that also has great range as they can scale with Geomancer's awesome Mas, effectively keeping Geomancer away from danger.<br/>Geomancer is not very strong in terms of direct combat despite its decent Mgt, and thus should not usually be used for combat. Players should avoid enemy phase combat as Geomancer is weak in terms of physical Bulk and Dodge.",
    "Rings": "Geomancer is a skill focused class, and thus would appreciate skill bosting rings such as Mystic and Lava rings. Skill range increasing effects such as Archmage and Farseer ring are also great. <br/> Heir ring is also a good match as Geomancer has good HP and boosting Mastery is greatly appreciated.<br/>If player wish to make Geomancer a more combat focused class, Surefire, Advantage and Bloodied ring are possible options, all of which utilises the class's good HP or Mas to boost combat performances.",
    "Weapons": "",
    "Class": "Geomancer naturally progress in to Cosmician, a class that offers one of the highest Mas growth in game, as well as passive that gives extra Mas, which can significantly boost the effects of Geomancer's skills. A perfect upgrade for Geomancer. <br/> Other tier 3 classes does not offer much to Geomancer, but will appreciate Geomancer's high Mas growth to boost their own Skill num.   "
  },
  {
    "ID": 10,
    "Classline": "Summoner",
    "Tier": 2,
    "Name": "Warlock",
    "Rating": [4.1, 4.2, 6.2, 4.8, 9.5, 1.5],
    "Stats": "Warlock focuses on Mgt and Dex, but lacks any good stat modifier in any other areas. In terms of growth, Warlock's Frt growth is the highest, Mgt and Dex growth are also great. However, all of Warlock's other growth are very lackluster.",
    "Character": "Amongst the four units capable of going into the Warlock class, Aya starts off as a Warlock. She has the highest Mgt, Spd and Lck, though her Spd is still not good enough to make her double most enemies. She has good Dex and Frt, but mediocre Mas and HP and terrible Def. Her Skill num is not very good and her combat is passable but shaky.<br/>Arthur has an impressive 60% Frt as Warlock, with good Mgt and Mas too. His Skill num is better than Aya's and his higher Bulk makes him better at combat than Aya most of the time as he is less likely to die to stray hits from enemies.<br/>Alden will have decent bulk but his low Spd and Mas makes it not a great choice, and Calith's low personal Mas growth will likely waste the good effects on Warlock.",
    "Upgrade1": ["Low", "High", "Low", "Top"],
    "Upgrade2": ["Mid", "Top", "High", "Mid"],
    "Skills": "While Warlock has one of the least apealing stat growths out there, it is made up by having possibly the most powerful set of passive and active skill effects in the game. Warlock's passive Blackflame allows Warlock to heal himself whener his attacks hits a Poisoned enemy by the same amount as damage dealt. As Warlock has good Mgt, it is not unlikely for Warlock to take a hit and then heal back to full, making Warlock a vampiric tank, or Nos-tank going by Fire Emblem terms.<br/>Warlock's Hellfire skill is one of the best Red skill in game as it not only has a high Mas scaling for damage, it also has a Mas scaling (albeit a low one) for range, making this skill not only hits much harder, but also further as you progress. Though player should note that Warlock itself does not make this skill super good, it needs the help of high Mas classes such as Cosmician to push it to absurd level of power. Increasing its power would be a top priority to make the spell more powerful and increasing range will make the skill hits further early on before Mas stat starts to matter. The heal is unnecessary because Warlock has much better form of healing already.<br/>Posion Nova is the crucial part of Warlock's kit, triggering Warlock's passive for healing and longevity. Even when Warlock's passive is not considered, a large Aoe Poison is a strong support for teammates to more effectively deal with weakened enemies. Increasing range is absolutely essential, and unlike a few other AOE, Poison Nova's effect is not weakend by having more targets. Increasing effectiveness and lowering cost are also fine upgrades to consider afterwards.",
    "Tips": "Warlock is a class not to be judged at base value. The class focuses heavily on Skill effects. Poison Nova is an extremely powerful AOE Poison that can boost Warlock's otherwise lackluster combat to good level. Hellfire is a valuable damage skill that has a scalable range. Blackflame easily turns Warlock into an unkillable tank with the right setup despite Warlock's poor Bulk at base.<br/>Warlock is terrible at base though, being probably the weakest in term of general combat performance due to its low Bulk and mediocre combat stats. It is highly recommended for players that want to play a Warlock to focus on Warlock and give it all the proper tools to make it work, as half-hearted Warlock build will easily fall apart due to its weak bases.",
    "Rings": "For Hellfire optimising build, increasing skill effect rings are prefered. Lava ring is the best because it increases not only the damage but also the range. Inferno ring is the strongest in terms of increasing Skill num and Hellfire is one of the few skills that can benefit from it. Range increasing rings also works so Archmage and Farseer rings are good.<br/>If player wishes to optimise for Nos-tank combat, then Chosen ring is a must have, as Warlock's low Bulk may result in unit unable to recover fully from strong enemy attacks. Chosen ring makes sure that Warlock can only be defeated in 3 hits regardless of how strong the enemy is. Farseer ring is once again a good option as it can also increase the AOE of Poison Nova. Bloodied ring is also an option as it can increase TSpd of Warlock, something a combat Warlock sorely desires.",
    "Weapons": "",
    "Class": "Warlock naturally progresses into Necromancer class, which has a stat spread similiar to Warlock. It is an ok class to be in, but offers nothing in particular for Warlock. Warlock's skillset is so strong that it usually cares not for tier 3 class's skillset, and would prefer the class to have a better stat modifier.<br/>Cosmician is the go to class if player wishes for Warlock to optimise the powerful Hellfire, as Mas will be the essential stat. No class in game offers more Mas than Cosmician with its high Mas growth and Mas increasing passive.<br/>If combat and Nos-tanking is the preferred way to play Warlock, then Loremaster is the best choice because Spd is the essential stat. The Nos-tanking strategy hinges solely on Warlock being capable of doubling enemies. It is also recommended to grow in Scholar first before going into Warlock or Grim Loremaster."
  },
  {
    "ID": 11,
    "Classline": "Summoner",
    "Tier": 2,
    "Name": "Aegis",
    "Rating": [7.3, 3.7, 4.5, 3.2, 3.0, 5.0],
    "Stats": "Aegis's stats focus on HP and Def, it has a +1 in Mgt too. Aegis other stat modifiers are all 0 or negative, the lowest being Lck with a -2. In terms of growth, Aegis has decent HP and good Def and Frt growth, making Aegis a tanky class. All of its other growth are all lackluster.<",
    "Character": "None of the characters you have starts off in this class. Base on growth, Alden will have the best in terms of Bulk yielding the highest HP, Def and great Frt growth amongst the four units. All his other growth however, are either mediocre or abysmal. <br/>Aya has the most balanced growth in Aegis class, with no growth below 35%. However, it also means Aegis Aya has problem excelling in anything at all, espcially with mediocre Spd, below average Mas and middling Bulk making her excel in neither combat nor Skill num. <br/>Calith has lowest Mas growth, which is not something Aegis desires. While Calith's bulk is decent, Calith will not be doing much in return due to low Mgt and Spd.<br/> Arthur can be an Aegis due to having the highest Mas amongst all Summoner units. He will also have good Def and highest Frt. His combat may not be stellar, but at least Arthur is a great user of Aegis' Skills.",
    "Upgrade1": ["Low", "Mid", "Low", "Low"],
    "Upgrade2": ["High", "Top", "Mid", "Mid"],
    "Skills": "Aegis's passive increases the class's damage done if it took damage. It looks synergetic on paper but Aegis's damage output is still horrible even after the buff.<br/>Aegis's Relic Refraction applies AOE Blind to enemies, reducing their Acc and indirectly increases the longevity of your units. It is not a very reliable debuff as some enemies will still have considerable Hit chance after the debuff. This debuff is also anti-synergetic with the other skill of Aegis.<br/>Repulsor Shield is the signature ability, it is also the most effective way to deal with horde of enemies. If multiple instances of Repulsor Shield are casted onto the same target, the amount of damage will be added together. One stragtegy is to use multiple instances of Repulsor Shield on Juggernaut, and combine with Juggernaut's Wreathed in Flame for massive reflect damage to kill enemies during enemy phase. On higher difficulties, Godfrost with Absolute Zero can be a more reliable target. Increasing duration is the strongest upgrade as it aloows for more time and more stacks. Reducing mana cost is also great for more instances of skill usage.",
    "Tips": "Aegis is a tanky class capable of taking a hit, but does not do much in return with lackluster combat. The class is generally more used as a support unit with nice skills and the tankiness helps in making Aegis less peculiar about positioning compared to the more squishy supports. Use Aegis for its skills, or as a shield against possible stray attacks on your more squishy units.",
    "Rings": "Aegis does not really need any rings to perform its job, but rings that increase its tankiness is still good. Hallowed, Dauntless and Indomitable are all good choices.<br/>Charged ring is also a possible option allowing for faster mana generation and more Repulsor Shield casts.<br/> Plague ring is niche but works well if player choose to use Aegis itself as Repulsor Shield target for enemy phase damage reflecting.<br/>Lastly, Solemn ring may not be the best ring for Aegis itself, it is a very synergetic ring to go with Repulsor Shield target. The ring basically removes dodge from the target and instead halves the damage taken 40% of the time, which is perfect for Repulsor Shield targets who do not want the enemy to miss their attacks.",
    "Weapons": "",
    "Class": "Aegis naturally progresses into Relic Knight class, which is a good tank class. It can carry on Aegis's legacy of being a tanky support capable of resisting stray attacks, but offers little skill wise.<br/>Cosmician is a good choice if you wish to optimise Repulsor Shield's Skill num due to its high Mas growth and Mas increasing passive."
  },
  {
    "ID": 12,
    "Classline": "Summoner",
    "Tier": 2,
    "Name": "Scholar",
    "Rating": [2.8, 5.9, 4.7, 4.7, 1.0, 10.0],
    "Stats": "Scholar is a balanced class with no particular strength or weakness but has better modifier in Spd, Mas and Lck and worse modifiers in HP, Dex and Frt. Its growth focuses on Mgt, Spd and Mas, and has mediocre HP growth. Scholar's growth in Dex, Def, Frt and Lck are low.",
    "Character": "Amongst the four units capable of going into the Scholar class, Alden starts off as a Scholar. He has good HP, Mgt, Spd and Mas, ok Def and Frt but low Dex and Lck. Alden has ok Bulk, TSpd and Pwr and Skill num, but low Acc will severely hamper his combat.<br/>Calith is similiar to Alden, but will have lower HP, defenses and Mas inexchange for much better Dex and Lck, makng Calith more combat focused.<br/>Arthur will have the best Mas amongst the four, and also good Mgt and Spd, making him good at using skills and attacking. He will also have decent bulk against Magical foes but his Acc and physical Bulk are lacking.<br/>Aya is probably the strongest in terms of combat Pwr with ok Dex and good Lck combined with great Mgt and Spd. Her Mas is also decent, bulk her Bulk will be severely lacking.",
    "Upgrade1": ["Mid", "Mid", "Top", "Mid"],
    "Upgrade2": ["High", "Low", "Mid", "Mid"],
    "Skills": "Scholar's passive allows unit to stack Frt as the battle continues, which can result in a sizable buff at the end of the battle. It is not extremely useful but can be great against hordes of powerful Magical enemies at the end of a chapter. Arthur's personal skill is a decent skill to go with as both will stack up on buffs throughout the chapter.<br/>Phase is a strong skill that works like Warp staff in multiple Fire Emblem games. Its usage in Dark Deity 2 is less dominating but a very strong effect regardless, capable of clearing objectives much faster within time constrain. Allowing self-cast is a very strong effect allowing for self-blink shenenigans.<br/>Ancient Writ is the only skill in this game that refills mana by a significant amount, providing a lot of utility plays.Best targets of this skill include units equipping the Attuned ring, or refreshed units that are low on mana and still have their action left for the turn. Reducing mana cost is the best upgrade to allow more usage of the skill. Increasing mana gained from the skill and debuff removal are nice to have upgrades when needed.",
    "Tips": "Scholar has decent stats for combat and decent Mas for skill usage, as well as a good supportive skillset. Player can use is more as a combat class or solely focus on using its skills as a support. <br/>Even though Scholar can do combat, it is not as great as many of the more combat focused classes, so players need to be careful not to engage multiple enemies in enemy phase.",
    "Rings": "Scholar would enjoy rings that boosts skill performance like Lava, Mystic and Heir ring. Charged ring is also great for more skill usage. <br/>If player wishes to make the unit more combat focused, Bloodied and Advanatge ring are good options. Surefire ring is also a good choice to boost Scholar's lackluster Acc by its decent Mas stat.",
    "Weapons": "",
    "Class": "Scholar naturally progresses into the Loremaster class, which is also a supportive class with some decent combat. Nothing particularly of interest in terms of chemistry and synergy happens between the two classes.<br/>Cosmician is a great class for any tier 2 Summoner classes with great skills. It will boost the Skill num of Scholar skills to great heights."
  },
  {
    "ID": 13,
    "Classline": "Shaman",
    "Tier": 2,
    "Name": "Juggernaut",
    "Rating": [6.8, 3.5, 3.4, 3.9, 4.0, 5.5],
    "Stats": "In terms of stat modifiers, Juggernaut is really strong with no negative modifiers, and a good HP and Lck modifier. Growth-wise Juggernaut has good HP, Mgt and Def, decent Frt and Lck, not so good Dex, and bad Spd and Mas growth.",
    "Character": "None of the characters you have starts off in this class. Base on growth, Khamari will have the highest Def and Frt growth, as well as great HP growth. Coupling with his passive, he should have the best Bulk in game during the early-mid game. He also have good Mgt and passable Dex and Lck, but his SPd and Mas are rather lackluster.<br/>Laurai has same Def growth as Khamari, and even higher HP growth, making her a stronger Physical tank, but her Frt is weak and Spd is lacking, so she will have problem taking on fast Magical attackers. Shehas great Mgt for combat but her Mas is low so her skills are not as effective.<br/>Haoran will have the highest Mgt and Mas growth amongst te four, he also have great defense growth and an ok HP growth, allowing Haoran to tank some damage. Haoran will however, have low Spd and Lck, making him unable to double or crit reliably.<br/>Cassandra will transit smoothly due to retaining her Axe and having balanced growth. She will not be suffering from any area in particular other than her questionable Spd, but does not excel in any particular area either.",
    "Upgrade1": ["Low", "Top", "Mid", "Mid"],
    "Upgrade2": ["High", "High", "High", "Mid"],
    "Skills": "Juggernaut's passive gives mana to unit whenever it takes damage, which works well with the class's strategy of being on the front line and tanking damage, though in lower difficulties, the class's high defenses may become anti-synergetic with its passive as it can tank hits with no damage at all.<br/>Absorb Pain is a powerful support against debuffing enemies, though it is somewhat situational. The heal is nice to have but the primary goal is to remove debuffs from the unit itself and nearby allies. Increasing the range makes the skill much more useful and should be a top priority upgrade. This is skill is usually used to clear Juggernaut's own debuff though, providing some nice healing.<br/>Wreathed in Flame is the signature ability of Juggernaut and works immensely well with Repulsor Shield for easy kills during enemy phase. Note that it only triggers when the enemy unit is not killed at the end of the turn, and does not require the enemy to hit. Multiple stacks of this skill will combine their damage and be exahusted simultaneously even if only one instance has enough damage to kill. Duration increase and cost reduction are both great upgrades as players would want the skill to affect as many enemies as possible.",
    "Tips": "Juggernaut is a tank class with good stats to back it up. It also has skills that synergies with taking hits, and thus is probably the best receiver for Ageis's Repulsor Shield skill. It is also self-sufficent with a self heal and debuff-cleanse. Juggernaut should be spamming Wreathed in Flame and be at the frontline tanking as much damage as possible. <br/>While tanky, Juggernaut is not invincible and will take double hits from most enemies, so player should take note not to let a Juggernaut at low health tank hits without heal, especially on higher difficulties.",
    "Rings": "Juggernaut prefers rings that increases its Bulk, so Indomitable, Hollowed and Dauntless rings are all great. <br/>Plague ring is decent combination to Wreathed in Flame for higher end of turn damage, and Solemn ring is a niche choice as it can provide damage reduction at times. Losing dodge for Juggernaut is not a big issue as the class does not dodge very often in the first place.",
    "Weapons": "",
    "Class": "Juggernaut naturally progresses into the Dreadnought class, which is similiarly built as a tank class, and has a passive that patches up the low accuracy the classline has, which is perfect for the inaccurate tank. All other classes generally do not need the growths or skills from Juggernaut."
  },
  {
    "ID": 14,
    "Classline": "Shaman",
    "Tier": 2,
    "Name": "Waveseer",
    "Rating": [5.0, 5.7, 5.6, 3.1, 2.0, 6.0],
    "Stats": "Waveseer has very high and low stat modifier. The class has very good Spd and Mas modifier, but HP, Mgt and Def modifier are very negative. In term of growth, Waveseer has good Spd, Frt and Mas growth, and mediocre to low growth in all other area.",
    "Character": "Amongst the four units capable of going into the Waveseer class, Haoran starts off as a Waveseer. He has the highest Mas amongst the four but the lowest HP, He has decent stat growths in all other areas except Lck. He is a good support unit with Skills but not very good at combat due to low HP and Crt.<br/>Cassandra and Laurai will have great Spd growth. Cassandra will have good Mas and Frt, but will not be a good combat class due to low Mgt and Dex. Laurai has good HP and better Mgt, Dex and Def than Cassandra, but will have lower Frt, Mas and Lck, making her better at combat but has worse Skill num than Cassandra.<br/>Khamari will have decent Bulk and TSpd as Waveseer, but his combat and Skill num are all not very impressive. Waveseer Khamari compromises his Bulk to receive some increase in Spd, this will hinder his usual gameplay.",
    "Upgrade1": ["Low", "High", "High", "Mid"],
    "Upgrade2": ["Mid", "Mid", "Mid", "Mid"],
    "Skills": "Waveseer's passive is one of the strongest in the game, providing a 30% mana cost reduction to all active skills the unit has, even their personal and tier 3 class skills. It is extremely useful for any unit or class that uses a lot of skills throughout the battle, and remains somewhat useful for all other classes as long as there is any skill usage.<br/>Healing Wave is a nice healing move that can heal multiple units at once. It is not very strong in term of Skill num but provides more than enough most of the time. Increasing target for this skill also increases the skill's range and player does not need a target adjacent to unit to use this skill. If target reaches 4 for example, the unit can simply just heal one unit in a line 4 tiles away even if there are no allies in between.<br/>Whirlpool is a niche utility skill that can either trap units within or block enemies from passing through it. It is great for buying time or preventing too many enemies from engaging a certain unit of yours. It has a hig mana cost, but is actually offsetted by Waveseer's own passive. Increasing in duration can compound with Aqua ring to give a total of 3 turns of effect.",
    "Tips": "Waveseer is a support focused class with good Spd as a bonus. It is an option for combat focused class to go into before promoting into tier 3 if the unit wishes for maximum Spd. Its passive is also a great option for tier 3 classes to reduce their skills' mana cost.<br/>Wavesser's combat capability is poor due to low Mgt and Acc, though it is not a big deal at lower difficulty due to enemies having low bulk and dodge. While Waveseer's stats are not impressive for combat, it does have good Spd, which means most enemies cannot double Waveseer, essentially making the class bulkier than it looks. As a support class, the stats bar Mas also hardly matter in the class's effectiveness.",
    "Rings": "Waveseer focuses on support skills, so Charged ring is a good choice. Aqua ring affects both Whirlpool and Healing Wave and can be considered for increasing effect, though note that Aqua ring affects Healing Wave's target number, not healing number, and only has an effect on Whirlpool if player has upgraded the Duration first.<br/>As a healing unit, rings that enhances heal are also great choices. Lifebringer ring is probably the best for Waveseer as not only it boosts Healing Wave it can also enhance the healing skills of all Shaman units. Prophet and Brightening rings provide healing target additional stats which can be useful for their combat, giving Waveseer more support options, while Sacred ring is a good way for Waveseer to heal itself while using skills frequently.",
    "Weapons": "",
    "Class": "Waveseer naturally progresses into the Tidecaller class. Tidecaller is also a support class with great Spd but terrible combat.The classline has good Skill num and unique skills that are very useful for many occassions and thus player will find good use for Waveseer's passive.<br/>Hemomancer is the more combat focused class of Shaman classline. While Hemomancer would prefer Ritualist's class skill set, going into Waveseer first for more Spd is also very welcomed by Hemomancer.<br/>Spirit Keeper would also appreciate Waveseer, partially because the higher Spd growth of Waveseer can prevent Spirit Keeper from being doubled by many enemies, but also because the passive cost reduction allows for more uses of Spirit Keeper's high cost skills."
  },
  {
    "ID": 15,
    "Classline": "Shaman",
    "Tier": 2,
    "Name": "Elementalist",
    "Rating": [4.2, 3.5, 5.6, 4.5, 7.0, 6.0],
    "Stats": "Elementalist has good Mgt, Dex and Mas modifier, but negative HP, Def and Lck modifier. In terms of growth, Elementalist focuses on Mgt, Dex and Mas, and also has a decent Frt growth modifier. Its growth in HP, Spd, Def and Lck are  all terrible.",
    "Character": "Amongst the four units capable of going into the Elementalist class, Laurai starts off as a Elementalist. She has great Mgt, Dex, decent HP, Spd, Def and Mas, but poor Frt and Lck. She is capable of dealing decent damage and has ok Skill num. <br/>Haoran has the highest Mgt and Mas, making him great at dealing both combat and skill damage. However, his abysmal HP, Spd and Lck, and mediocre defenses make him very vulnerable to enemy attacks.<br/>Khamari has decent growth all around other than Spd and Lck, making him a decent Elementalist. He will have great Magical bulk with good combat and skill damage.<br/>Cassandra is similiar to  Khamari except having much worse Physical bulk but slightly better Spd, Mas and Lck, making her better at dealing damage but worse at taking physcial hits.",
    "Upgrade1": ["Top", "Low", "Mid", "Mid"],
    "Upgrade2": ["Low", "High", "High", "Mid"],
    "Skills": "Elementalist's passive cements its role as damage dealer in both combat and skills, as the passive boost the class's comat damage, but only if the class uses skills first. It is advisable to use a few skills first, before attacking for a powerful single hit.<br/>Ice Shield is a decent support skill that can boost unit's own or allies' survivability. Allowing self-cast is a very strong upgrade that can allow Elementalist to survive if the unit is forced to take hits.<br/>Flame Strike is a good AOE damage that can be accessed early. it is a costly skill, so lowering mana cost is highly appreciated. Increasing range from 2 to 3 also greatly increases the range of enemies this skill can reach.",
    "Tips": "Elementalist focuses on damage, both combat and skill. Its skills uses two opposing elements and also have opposing effects: Ice Shield reduces damage while Flame Strike deals damage, making Elementalists very versatile in terms of utility.<br/> However, Elementalist's actual combat is not great due to lackluster Bulk and Dodge. It is also slow and prone to get doubled. Thus it is advisable that players do not let Elementalist engage in combat during enemy phaser too much, and instead focuses on killing with Flame Strike and support with Ice Shield at a distance, only ever bringing in Elementalist for combat for the kill.",
    "Rings": "Elementalist has heavy skill cost, thus Charged ring is preferred. Archmage and Farseer ring are also great to provide more range to Elementalist skills.<br/>Skill scaling increasing rings are also useful, like Lava and Mystic ring. Flame Strike also benefits from Inferno ring, making it very powerful. Radiance ring is also a possible option as Flame Strike can damage multiple enemies at once.",
    "Weapons": "",
    "Class": "Elementalist naturally progresses into the Spirit Keeper class, a class that has powerful skills and a passive that increases Skill num if the unit performs combat, which perfectly synergises into Elementalist's style of dealing heavy damage both through combat and skill. The unit's combat strengthens its skill effect and skill usage strengthens combat.<br/>Tidecaller is also greatly synergetic as it provides even more bonus every time a skill is used, making the unit very potent late into the battle."
  },
  {
    "ID": 16,
    "Classline": "Shaman",
    "Tier": 2,
    "Name": "Ritualist",
    "Rating": [5.3, 5.3, 5.1, 4.0, 7.5, 2.0],
    "Stats": "Ritualist's stats focuses on HP and Lck, with a little boost to Mgt and Spd. The stat modifiers on Def and Frt are very negative. In terms of growth, Ritualist has good HP, Mgt and Lck growth, as well as average Dex, its Spd, Def and Frt growth are bad.",
    "Character": "Amongst the four units capable of going into the Ritualist class, Khamari starts off as a Ritualist. He has very high total growth, excellent HP growth, great Mgt growth, and good growth in all other areas, except Spd and Mas. He can work as a bulky Ritualist, but the class makes him more of a balanced unit than one optimising on his strength.<br/>Laurai has the highest HP growth, good Mgt, Spd, Dex and Lck growth, making her a decent combat unit, but her Skill num will be low due to mdeiocre Mas and her Frt growth is abysmal.<br/> Haoran has the highest Mgt and Mas growth, making his Skill num good, but his low Spd will stop him from doubling enemies in combat, something quite detrimental for Ritualist.<br/>Cassandra has decent Mgt, Spd, Mas and Lck growth, and good HP and decent Frt makes her a decent Magical tank too. She is however, frail in terms of Physical bulk, and her Acc is more shaky than the other Shamans.",
    "Upgrade1": ["Low", "High", "Mid", "High"],
    "Upgrade2": ["Mid", "Mid", "Low", "Low"],
    "Skills": "Ritualist's passive Bloodmage gives the class a chance to play similiarly to Nos-tanks in FE, where the class can take hits and recover back lost HP during attacks. Do note that Bloodmage recovers HP based on Bleed stacks, not damage dealt, so make sure more stacks are applied, and that players should aim for more, instead of heavier, attacks.<br/>Transfusion is a highly synergetic skill for Ritualists as it applies Bleed to up to enemies. Even if targets do not end up provide healing for Ritualist, it is still a good debuff to have. Increasing stacks are important for reasons already mentioned, while cost reduction is always good for more uses of the skill.<br/>Hex is a niche skill due to how much Ritualist would prefer Transfusion. Weak is also not a strong debuff and players generally do not wish to face any enemy attacks in the first place. Mana cost reduction and increase range thus is the better options just to provide more situations where the skill is useful.",
    "Tips": "Ritualist is a more combat focused Shaman class, that requires support more than it supports others. Players may want to chip in more resources if they wish to utilise a Ritualist well. If the Bleed stacks can be applied properly, Ritualist has the chance to turn into an unkillable tank capable of tearing through hordes of enemies.<br/>Ritualist is not very fast or strong, and its Bulk will be short if Bleed stacks are not applied. Thus it is not advisable for players to use this class half-heartedly.",
    "Rings": "Due to Ritualist's passive, Plague ring is almost a must-have as long as you intend for Ritualist to see combat. Solemn ring is a good combination as it guarantees enemies to hit Ritualists, which can then activate its passive on counter-attack.<br/>Bloodied ring is also a good choice as Ritualist's high HP will allow Bloodied ring to reach its max effectiveness sooner. Increasing secondary stats especially TSpd is also very welcomed for Ritualist who wishes to double enemies as much as possible.",
    "Weapons": "",
    "Class": "Ritualist naturally progresses into the Hemomancer class which is a stronger version of Ritualist. The stronger stats do make the unit's gameplay much more reliable, but provides little substance.<br/>Spirit Keeper requires combat for its passive, which Ritualist can do decently well. Both classes have at least decent Mas which makes the Skill num decently high for effective skill effect."
  },
  {
    "ID": 17,
    "Classline": "Adept",
    "Tier": 2,
    "Name": "Gale",
    "Rating": [2.6, 7.5, 3.1, 6.4, 7.0, 4.0],
    "Stats": "Gale is a class focusing on Spd and Lck. It also has positive stat modifier on Dex and Mas. The class is weak in HP, Def and Frt, while also having no Mgt modifier. In terms of growth, the class is good in Spd, Dex and Lck, and a midding growth in HP, Mgt and Mas. Its growth in Def and Frt are very poor.",
    "Character": "Amongst the four units capable of going into the Gale class, Mashal starts off as a Gale. She is also the most aligned in terms of growth. With high Spd, decent Dex and Lck, Mashal is capable of doubling and critting on many occassion. her defenses and Mas however, will be lackluster.<br/>Tal'Dera will be very skewed in terms of stats, with good Mgt, Spd and Dex, as well as a monstrous Lck growth, making her a strong and fast crit machine. However, her HP, Def and Frt growth are atrocious, Mas growth is also low, making her extremely frail.<br/>Zuhair will have very balanced growth, with decent to good Mgt, Spd, Dex, Frt, Mas and Lck growth, great HP growth but poor Def growth, making him a decent Magical tank with good combat damage and decent Skill num.<br/>Saxon will have decent growth in all areas except Frt, making him a good unit overall, but not excellent in any areas.",
    "Upgrade1": ["Mid", "Mid", "Low", "High"],
    "Upgrade2": ["High", "High", "High", "Low"],
    "Skills": "Gale's passive provides extra damage for the class, which is a great boost for a class that has good TSpd for doubling and good Crit potential. The condition is not so easy to fulfill however, as Weak is not a vey common debuff, most of the time Gale needs to apply the debuff itself with skill activation.<br/>Ravager Winds is the defining skill of Gale as it applies the much needed Weak debuff to enemies, further boosting Gale's damage output. It can also be upgraded to apply Poison, one of the strongest debuff in game, which also can increase Gale's damage. Reducing cost can allow the skill to be used more often, and applying snare can be used to support classes that prefer multiple debuffs on enemies such as Devoted or Hemomancer.<br/>Stormborn is a niche skill that can be useful if there are more Physcially bulky enemies like Lancer or Archer. It can also be used as a cheap Debuff cleanser for Gale due to its low cost.",
    "Tips": "Gale is a Spd focused class that has excellent combat and some Dodge potential. The class can double most enemies without much difficulty, so player should focus more on giving the unit more Crit or Power. Ravager Winds should be the prime focus for any unit not Mashal before they go into any tier 3 classes.<br/>Gale's skills are not very strong. Ravager Winds's Weak debuff is mostly used for triggering Gale's passive rather than the effect itself, and can only apply 1 stack of Light Poison. Stormborn is extremely niche and seldom used for its primary effect. Furthermore, while Gale has good Spd and thus Ddg, it cannot reliably dodge based on base stats alone and does not have a Dodge boosting passive like Nightblade, Cutthroat or Ancarant, so players shoud not use Gale as a Dodge tank.",
    "Rings": "Gale would enjoy Crit increasing rings such as Dominator and Soulfire. Bloodied ring is also great for its all around stat boost.<br/>RIngs that increases Dodge can also be used to boost Gale's Dodge to a reliable level, so Depth and Diplomat ring can be considered. Solemn ring also can be used to effectively half incoming damage.",
    "Weapons": "",
    "Class": "Gale naturally progresses into Tempest class, which is also a fast, Crit focused combat class. Gale supports Tempest fine as Tempest can utilitse the damage boost from Gale's passive well, and Poison from Ravager Winds lowers enemy's TSpd, which provides further bonus for Tempest's passive.<br/>Ascendant is also a combat focused class that would enjoy Gale's high Spd growth, but would prefer Monk's skillset instead.Stormkeeper is in a similiar situation where Gale's growths are preferred but not its skillset."
  },
  {
    "ID": 18,
    "Classline": "Adept",
    "Tier": 2,
    "Name": "Conduit",
    "Rating": [2.9, 5.0, 5.0, 5.5, 7.5, 6.0],
    "Stats": "Conduit is a class focusing on Mgt, Mas and Lck, while suffering from HP, Spd and Def negative modifiers. Its Frt modifier is also decently high. In terms of growth, Conduit has good growths in Mgt, Frt and Mas, and decent Lck. Its growth in HP, Spd, Dex and Def are low.",
    "Character": "Amongst the four units capable of going into the Conduit class, Tal'Dera starts off as a Conduit. She has monstrous Mgt and Lck, and will be dealing massive combat damage with her Crits.She will also have decent Dex, Frt and Mas. However, her Spd is mediocre, and will have abysmal HP and Def, making her pretty much a glass cannon.<br/>Zuhair will have good HP and Frt, making him a great Magical tank. He will have high Mgt and even hiher Mas, making his Skill num very good. The downside will be his low Def, which may hamper his effectiveness as a tank later.<br>Mashal will have good Mgt as a COnduit, but er Spd is only average, which means she may have trouble doubling enemies. Her Bulk is also hampered by her low HP growth.<br/>Saxon is also a strong candidate for Conduit with his high Mgt and Mas. However, his Spd is rather low, making him vulnerable to doubling from enemies, which is further hampered by his low HP growth, though his defenses are actually decent. Saxon's other problem is his low Lck, which results in less Crit, something Conduit would not want.",
    "Upgrade1": ["Mid", "High", "High", "High"],
    "Upgrade2": ["Low", "Low", "Low", "Mid"],
    "Skills": "Conduit's passive grants Crit chance for the unit if mana has been used within 2 tiles, inclusive of the unit itself, making the class an amalgamation of combat and skill usage. It is a decent skill on its own but would combine with other skills such as Tal'Dera's passive for greater effect. <br/>Chain Lightning is a great damage skill capable of dealing with a group of closely positioned enemies. In higher difficulties where enemies usually can survive a round of combat and may get messy as they start to clog around, Chain Lightning is a great way to soften up multiple enemies at the same time. Increasing range for more positioning option is a great upgrade due to Conduit's lackluster bulk, as COnduit wants to stay away from enemies if possible. Increasing number of targets greatly increases total damage output and can deal with more enemies at the same time.<br/>Defribilate is an extremely powerful heal that also comes with a strong side effect. It is possibly the strongest heal skill in the game with massive Mas scaling for a class with high Mas. However the target is also Stunned and will be unable to act next turn (the target can still act on the turn it gets healed if it has not acted yet).Cost reduction and granting Mana are unnecessary because it is not a skill that is used often or casually. Mas scaling increase is also unnecessary as it is very powerful even at base and does not really need an upgrade.",
    "Tips": "Conduit is a great class if you are looking for a unit that can damage multiple enemies at once. It also has a powerful heal that can almost fully heal any severely injured ally. Its high Mas growth also means that players can opt for Conduit just for growth even if its skillset is not what the unit wants going into tier 3.<br/>Conduit's combat is not as great as it looks on paper. Its poor Bulk usually means that Conduit wishes to kill enemies before they have a chance to counter. The increase in Crit lasts only one hit, and resets even if the attack does not crit, so it is highly advised to build up the Crit chance to ensure a Crit first before engaging in combat.",
    "Rings": "Rings that increases Crit chance is very effective for Conduit to ensure that Crit lands. Soulfire and Dominator are both decent choices. Destiny is also ok but note that it does not proc if Conduit uses Chain Lightning. <br/>Rings that boost skills or generate mana are also great choices for Conduit. Lava and Mystic rings makes Chain Lightning more powerful, Charged ring lets Conduit recover mana faster, and Archmage and Farseer ring increases Conduit's skill range.<br/>Lastly, Radiance ring gets a special mention as its effect synergies well with Conduit's ability to deal direct skill damage to multiple enemies at once, meaning the effect of Radiance ring can be maximised.",
    "Weapons": "",
    "Class": "Conduit naturally progresses into the Storm Keeper class, another Lightning themed Skill reliant class with powerful skill effects but also wishes to engage in direct combat. The two classes' passives work well together and can greatly increases the unit's self-sufficiency. Rings that benefits Conduit will also be very useful for Storm Keeper.<br/>Conduit will provide the necessary Mas and Frt growth that a non-Zuhair Godfrost wants. Godfrost would love Conduit's high Mas to boost Absolute Zero to insane numbers, especially on Demonic where enemy Pwr may be ovewhelming.<br/>Ascendant would also enjoy Conduit's high Mas growth for a more popwerful Divine Flow. Having Conduit's passive to increase Crit chance is also a welcoming addition to Ascedant's combat. "
  },
  {
    "ID": 19,
    "Classline": "Adept",
    "Tier": 2,
    "Name": "Frigillan",
    "Rating": [5.9, 3.8, 3.4, 4.6, 2.0, 6.0],
    "Stats": "Frigillan's stat modifier focuses on HP, Mgt and Mas, with a little Def. It has negative modifier in Spd, Dex, Frt and Lck. In terms of growth, Frigillan has good growth in HP, Mgt and Def, lackluster Lck and Frt, and abysmal Spd, Dex and Mas.",
    "Character": "Amongst the four units capable of going into the Frigillan class, Zuhair starts off as a Frigillan. He has the higest Frt growth amongst the four possible Adept units, making him the most balanced tank in Frigillan class. He will also have good Mgt and decent Mas. His Spd, Dex and Lck will be mediocre.<br/>Saxon will have massive growth in Def, and great HP and Mgt, making him a very strong Physical tank. He will have terrible Dex, which will affect his Accuracy.<br/>Tal'Dera will have the highest Mgt, as well as good Dex and Lck. However, her Bulk remains low, especially her Magical bulk.<br/>Mashal will have ok Spd and Dex and good Mgt, making her combat ability good. However, she will suffer from poor Frt and Mas.",
    "Upgrade1": ["Low", "Mid", "High", "Mid"],
    "Upgrade2": ["Mid", "Low", "Mid", "High"],
    "Skills": "Frigillan's passive increases the unit's Pwr and Acc when Block is active on the unit. It is a decent skill. The Pwr boost is an icing on the cake, but the 25 Acc increase can be very useful for Frigillan due to its low Dex mod and growth. Players do need to note as Block instances can be used up quite fast as Frigillan usually engages with multiple enemies during enemy phase, and if Block is used up before Frigillan counters, the bonus from passive will not be there any more.<br/>Icy Spire is a niche enviornmental skill that can be used to block off certain spot so units face less enemies. It is a very situational skill and most of the time it is not essential. Increasing duration and range ae nice upgrades, and reducing cost also makes the skill more applicable.<br/>Defensive Stance is a nice and synergetic skill for Frigillan. Block is a very powerful buff for tank units, greatly increasing the unit's survivability. Block is also synergetic with Frigillan's passive, and having the highest severity means the passive can be triggered on more attacks. Cleansing debuff is really great in making Frigillan a much more self-sustained unit, and reducing cost allows for more uses of the skill, which is preferred over stronger effect per use.",
    "Tips": "Frigillan is a tank class for the Adept classline. It is very effective at getting the job done. Defensive Stances is an extremely good skill for Frigillan as it boosts the unit's Bulk, damage output, and most importantly Accuracy at the same time. Player should always try to keep an in stance of Frigillan up when using the unit.<br/>Frigillan does have the issue of struggling to do meaningful things back to enemies, especially on higher difficulties. Frigillan does have good Mgt and thus damage on attack, but its slow Spd means it never doubles anything, and poor Dex results in attacks missing more often, not helped by Axe being the least accurate weapon type overall. The 25 Acc boost from passive is not always active and can be drained pretty quickly due to rigillan being slow and gets doubled very often. Player should find ways around the accuracy issue and not solely rely on Frigillan's passive.",
    "Rings": "Frigillan as a tank class would mostly prefer rings that boost Bulk. Tranquility is a great choice as it provides a big boost to Frigillan's weaker defense and synergies with the class' playstyle of absorbing damage without allies nearby. Dauntless, Dimming, Indomitable and Hallowed are all great options to boost the unit's Bulk even further.<br/>Accuracy boosting rings are also great choices for Frigillan, Solitude ring works similiar to Tranquility, providing Acc instead of Frt. Flux is an interesting choice as Frigillan usually have low Acc and Ddg, and thus would often have much lower hit rate than enemies, making Flux ring very effective. Solemn ring also gets a mention if player is going for Frigillan+Repulsor Shield combo, as Repulsor Shield require target to get hit. Solemn ring assures all attacks on target hits and reduces damage, making Frigillan even tankier.",
    "Weapons": "",
    "Class": "Frigillan naturally progresses into the Godfrost class, which has the potential to be the most tanky class in the entire game. The two classes synergies very well interms of stats and the buffs Defensive Stance provided for Frigillan is also appreciated by Godfrost. Though the problem is that Godfrost has little time and mana to use Defensive Stance over its own defensive skill: Absolute Zero, thus making Frigillan's entire skillset quite pointless.<br/>Ascedant has unusual synergy with Frigillan. While Ascedant has Divine Flow which just dodges all attack, seemingly make Bulk pointless, dodging also means instances of Block not spent when getting attacked. This means one single use of Defensive Stance and the Pwr and Acc boost from Frigillan's passive might last entire battle.<br/>Stormkeeper has great Frt, so boosting Def with Frigillan can be quite interesting, but the skillset of Frigillan is generally underwhelming. The same can be said for Tempest."
  },
  {
    "ID": 20,
    "Classline": "Adept",
    "Tier": 2,
    "Name": "Monk",
    "Rating": [3.8, 5.6, 4.5, 5.9, 6.5, 9.0],
    "Stats": "Monk has good stat modifier in Dex and Mas, and has positive modifier on HP, Mgt and Spd as well. Monk will have negative modifier on Def and Lck. In terms of growth, Monk has good growth on Spd, Dex, Frt and Mas, lackluster growth on HP, Mgt and Def, and abysmal Lck growth.",
    "Character": "None of the characters you have starts off in this class. Base on growth, Zuhair will have the highest total growth, excelling in HP, Dex, Frt and Mas. He will be a great unit although his Def is low and low Lck means his Crit chance are unreliable.<br/>Saxon will be decent all round other than a middling HP and an abysmal Lck. He will have problem Critting consistently, but with the skills Monk has, Saxon will make a solid combatant.<br/>Mashal will have decent Spd and Dex, and ok Mgt and Mas. Her Lck is still low, but she will have skills making up for it.<br/>Tal'Dera has the highest Lck and Dex growth, as well as good Mgt and Spd, making her a very powerful attacker. Her Bulk is still terrible and also has low Mas, which means her Skill num is not very high.",
    "Upgrade1": ["High", "Low", "Mid", "Low"],
    "Upgrade2": ["Low", "Mid", "Mid", "Mid"],
    "Skills": "Monk's passive is ok, because it is very easy to pull off with no drawbacks. It can even support the likes of Gale or Devoted for their passives. However, the Weak debuff itself is not very powerful, and Monk hardly needs it. <br/>Charged Ki is Monk's signature skill, and is a very powerful combat buff, one of the rare skills that can increase the unit's TSpd. It increases all of the unit's secondary stats, making it useful for any combat classes. This skill make Monk a top tier candidate regardless of which tier 3 class the unit would choose later. Reducing cost for this skill is highly recommended as able to keep the effect up consistently will drastically improve unit's performance. Cleansing of debuff is useful for battles with many debuffing effects.<br/>Ki Blast is a decent Red skill capable at dealing damage at a distance, something Monk lacks otherwise. It has a Mas scaling cast range which means it can grow as Monk grows. However, Monk is often needing Mana for Charged Ki, and the class's lackluster Mas growth means it does not have that big a range usually. Reducing mana cost is good, but Ki Blast's mana reduction is only 5. Range increase is a decent upgrade due to Monk's low Mas not increasing the range by much in the first place.",
    "Tips": "Monk is one the strongest tier 2 combat class around. Charged Ki is a skill every other combat class would kill for. Monk does not really have a weakness other than its 1 attack range. Player just needs to pay attention to keeping the effect of Charged Ki up, as Monk's combat performance without it will be significantly lower. Another weakness is tat due to Monk's low Lck, it is possible to not Crit a single time even when Charged Ki is up, so planning ahead for such situations is necessary.",
    "Rings": "Monk would enjoy Crit increasing rings, so Soulfire and Dominator rings are decent choices. Bloodied ring has similiar effect to Charged Ki, and is a powerful combo for Monk.<br/>Mana related rings are also great for Monk. Attuned ring is a covetted choice  to provide Monk with more Mana to spend at the start of the battle. Charged ring and Lava ring are also great choices to provide more usage of Charged Ki, or making it stronger.",
    "Weapons": "",
    "Class": "Monk naturally progresses into the Ascendant class, which is a combat class that has a powerful passive that allows the unit to dodge all attacks. Monk's Charged Ki can be used to boost Ascendant's combat performance, and the two classes have great synergy overall.<br/>Storm Keeper is also a decent choice for Monk, as it has high Mas growth and thus can benefit from Charged Ki. Tempest is also a good choice as it has high Spd and Crit growth, which Monk can support with Charged Ki."
  },
  {
    "ID": 21,
    "Classline": "Vanguard",
    "Tier": 3,
    "Name": "Reaper",
    "Rating": [4.9, 5.6, 7.5, 6.1, 7.5, 8.0],
    "Stats": "Reaper has good stat modifier on Dex, Mas and Lck, but low on Mgt, Spd, Def and Frt. In terms of growth, Reaper focuses on Mas and Lck, while also having good Mgt and Dex, mediocre HP and Spd, and low Def and Frt.<br/>Reaper's stats focuses on Crit chance with midding Power but poor ability to double, as well as having good Skill numbers. It is not a tanky class nor dodges very well.",
    "Character": "Reaper focuses on killing enemies at full HP using Crit, so Mgt and Lck are important, so is Mas as Reaper's active skills are also important for reliable crit. Benji can fulfill this role quite well with his high Mgt and Lck, though his Mas is low. His crit chance is not an issue even if Reaper's Mark is weak because of his inherent high Lck, but his Blink range will be less.<br/>Vissarion will have good Mgt and decent Lck, but most importantly his Mas is very high, making him a reliable Crit machine capable of Blinking over long distance. He will be weaker than Benji without buffs up though.<br/>Gwyn is well-rounded and will serve as a decent Reaper with a decent mix of Mgt, Mas, and Lck. She should be the most reliable at lower difficulty, but may not shine as much in more extreme scenarios on higher difficulty, as she is more likely to miss the killing threshold than the previous two.<br/>Valeria will be the fastest and most accurate Reaper with good Mas, but her low Lck makes her less reliable in critting, and more importantly her low Mgt may result in her unable to kill even when she crits, which is detrimental for Reaper.",
    "Upgrade1": ["Top", "Top", "Low", "Low"],
    "Upgrade2": ["Mid", "High", "Mid", "Mid"],
    "Skills": "Reaper's passive is crucial part of the class's playstyle. In Dark Deity 2 critical hits deals 2X damage, or 100% extra damage by default. Visage of Death increase this to 200%, or 3X damage. Note this only triggers if enemy is at full HP, meaning Reaper has no passive if enemy is not at full health. Considering Reaper is unlikely to double, the class usually wants to kill the target in one attack.<br/>Reaper's Mark is a crucial buff for Reaper, and is also a cruel joke because it is not self-targettable at base when Reaper usually is  the best recipient of this skill. Thus allowing for self-cast is crucial. From here on, increasing duration is also crucial as it is the only way for Reaper to Blink towards a target at a distance with Reaper's Mark still in effect.<br/>Blink is a strong utility skill, capable of reaching places which path is blocked, potentially ending chapters early, which is extremely useful under restricted turn limits. Increasing range by increasing Mas scaling is the most effective, but clearing debuff might be useful if player faces heavy debuffing.",
    "Tips": "Reaper is a combat class that specialises in taking down enemies at full HP. Player can spend one turn using Reaper's Mark and Destiny ring to build up crit chance and the next turn to kill, leave Reaper in range for a kill on counter attack. Once in a while, Reaper can Blink in to kill off a stray enemy or reach chests or other objectives that are ou of the way for main party. It is advisable to let Reapers handle low Def or Max Hp enemies like Magical enemies (bar Oversser) or Javelinier, Rogue or Sellsword and try to kill enemies in one hit, as Reaper is not a very bulky or dodgy class that can take hits well. It is also not advisable to leave Reaper in range of multiple enemies during enemy phase for the same reason.",
    "Rings": "Destiny ring provides a huge boost to Crit chance which is extremely beneficial for Reaper. Bloodied ring is always good for a support class and Soulfire and Dominator rings also provide Reaper with extra crit chance.<br/> If damage is an issue, Blazing, Antimage, Kindling and Competitor rings are all valid options as every extra damage is essentially 3 more damage when Reaper crits.",
    "Weapons": "",
    "Class": "The natural precessor of Reaper is Devoted, which is a decent choice, especially considering that fact that Devoted has a pssive that increases Crit chance, a very synergetic passive for Reaper. However, triggering Devoted's passive require set-up, like Devoted's Hemorrage. Players may find it more favourable to just use Reaper's Mark instead, as it will provide more Crit chance.<br/>A better tier 2 class to me is the Gallant class. Gallant has a passive that always triggers whenever Reaper's passive triggers, giving Reaper 5 extra damage, which is essentially 15 when Reaper crits. Gallant also has high Mgt growth than Devoted, increasing Reaper's kill threshold."
  },
  {
    "ID": 22,
    "Classline": "Vanguard",
    "Tier": 3,
    "Name": "Ancarant",
    "Rating": [3.8, 7.3, 6.8, 4.7, 8.5, 5.0],
    "Stats": "Ancarant hs great stat modifier in Spd and Mas, and good in Dex, Frt and Lck too. The stat modifier for HP, Mgt and Def are all negative. In terms of growth, Ancarant excels in Spd and Mas, with good Dex, Frt and Lck. Growth in HP, Def and Mgt however, are terrible. <br/>Ancarant is a dodge tank, with really good Spd to dobule most enemies but will not hit ver hard. The class can also tank Magical attacks well, but Physical attacks, if hit, will decimate Ancarant with ease.",
    "Character": "As a dodge tank with high Spd, Valeria fits into this class well with her growth. She has the 2nd highest possible Spd growth in the entire game and will be able to double most enemies bar the fastest Rogue or Sellsword. She also has Mas for her skill numbers. However, her Mgt and Lck are low. Low Mgt means she will struggle to deal meaningful damage, and low Lck will affect her Crit and Dodge. Both problems are resolvable but at higher difficulties she may fall to unlucky hits a little more often than player can endure.<br/>Gwyn and Benji are more balanced as Ancarant. Benji has good Mgt and Lck, but his lower base Spd affects his Dodge and ability to double faster enemies. Gwyn has good Spd, Mas and Lck but her Mgt is not very high. Both of them can work as Ancarant but have their own issues.<br/>Vissarion has good HP and Mas, but he is not powerful, fast or high Lck, basically not able to capitalise on Ancarant's strength, only useful as a support unit utilising the class's versatile skill pool.",
    "Upgrade1": ["High", "Low", "Mid", "High"],
    "Upgrade2": ["Low", "Mid", "High", "Mid"],
    "Skills": "Ancarant's passive is synergetic with not only the class's own playstyle of dodge tanking, but also its precessor, Nightblade's style on Dodge building by using skills. 25 Dodge is significant on its own, and can combine with Nightblade to give a maximum of 65 Dodge to the unit, making Ancarant capable of dodging even better than Cutthroat/Slayer sometimes.<br/>Moonlight Beacon is a very strong debuff skill capable of targeting many enemy units at once. It is a very good skill to open the chapter with if many enemies are close to your party. Its heavy cost may even be seen as a boon because it immediately put Ancarant into Mignight Ride's triggering range. Reducing mana cost is very useful if the unit has Nightblade as the unit needs to consistently use skills to keep the dodge up, while retain enough cost, at 65, to precisely push Ancarant into passive range. Poison is a powerful debuff and is a good upgrade too.<br/>Glaive Toss is a ranged Red skill. With Ancarant's high Mas, is capable of dealing with enemies at a same distance. While Ancarant cares not too much about safety at a distance, having an option to deal with enemies at a range is extremely welcomed by Ancarant which only has 1 attack range. Reducing mana cost is once again a good upgrade to allow more usage of the skill, while a heal off damage can serve as an emergency healing option in pinch situations.",
    "Tips": "Ancarant is extremely synergetic with Nightblade's skills, and it is highly recommended to have Nightblade as the tier 2 option. The strategy to use Ancarant should be to open with Moonlight Beacon, pushing the unit into Midnight Ride's range, as well as incurring 1 layer of Nightblade's passive Shadowstep, and then keep itself in Midnight Ride's range by consistently using skills every turn, which should not be hard to do as Nightblade/Ancarant has 3 low cost skills of different colors, capable of debuffing, damaging enemies and buff allies or self. In a pinch Ancarant can also face tank Magical attacks, though players should still be careful as the class has low HP.<br/> Trueseeing enemies who cannot miss is Ancarant's biggest nemesis, so avoid them at all cost. Ancarant will also have less reliable Dodge if mana exceeds 35, or if Exhaustion stacks built up when facing multiple enemies during enemy phase, so player needs to be careful not to send Ancarant into big hordes of enemies if mana exceeds 35 and does not have 2 layers of Shadowstep. Otherwise, Ancarant is likely to be one of your most reliable dodge tank and probably one of your few ways to actually take on enemies during enemy phase.",
    "Rings": "Ancarant has no problem doubling enemies nor have accuracy issue. The main issue of Ancarant should be damage. Thus, Advantage ring is very good for Ancarant as the class have low Mgt, high Mas, and high Spd the double.<br/>Player can also use Diplomat or Depth ring to further improve the unit's dodge to make the unit nigh untouchable.",
    "Weapons": "",
    "Class": "Ancarant synergies with its precessor Nightblade very well, and should not consider other classes for tier 2 options. However, if growth is concerned, Gallant is a good option for the unit to level up in before Lv 25, before going back into Nightblade and promoting into Ancarant."
  },
  {
    "ID": 23,
    "Classline": "Vanguard",
    "Tier": 3,
    "Name": "Ellisant",
    "Rating": [5.5, 3.7, 9.4, 4.9, 7.5, 4.5],
    "Stats": "Ellisant has great Mgt, Dex and Mas stat modifier, with some slight boost to HP, Def and Frt. The class has no stat boost in Lck, and a huge demerit in Spd. In terms of growth, Ellisant excels in Mgt, Dex and Mas, has decent Def growth, and low growth in HP, Mgt, Spd, Frt and Lck.<br/>Ellisant is a class capable of hitting hard and accurate, with strong skill num, but very slow and not good at tanking and dodging. Coupling with the skill Full Draw, Ellisant should only be fighting and supporting at a safe distance, never near the front line.",
    "Character": "Ellisant is a class focusing on powerful attacks from a distance, so Mgt and Mas are most important. Vissarion has the higest growth of the two stats combined. With his high Mas growth, he should have no problem reaching far with Full Draw. His Mgt and Dex growth are high, but he will not be doubleing or Critting with his Spd and Lck.<br/>Gwyn also has good Mgt and Mas, making her a capable Ellisant too. She also has decent bulk, making her able to go closer to enemy without fear of dying to random enemies easily.<br/>Valeria and Benji suffers from either low Mgt or low Mas. Valeria can still hit hard with good Mas, but will lose out on Dodge while still not having good bulk. She is relegated to a support row healing allies or buffing them with Eternal Sun. Benji will not be good at skills, instead will become a heavy hitter but at a much shorter attack range than the other Ellisants.",
    "Upgrade1": ["Mid", "Mid", "Low", "Mid"],
    "Upgrade2": ["Low", "Mid", "Mid", "High"],
    "Skills": "Ellisant's passive applies a debuff on enemy when attack, it is synergetic with its precessor Seeker, which also applies a debuff on enemy attacked. As Ellisant is neither good at doubling nor critting, it is likely that an enemy at high HP attacked by Ellisant will not die. Thus it is good for the passives to kick in and weaken the enemy for allies. Player can stack even more on-attack debuffs on Ellisant.<br/>Eternal Sun is an accuracy boosting skill that is good against hordes of high Dodge enemies such as Rogue or Sellsword. Reducing mana cost allows for more situation where the skill is usable and increase AOE can cover a lot of area.<br/>Full Draw is the main draw of Ellisant, allowing Ellisant to attack from a safe distance without the fear of a counter attack, which is something a class with neither Bulk nor Dodge wants. Increasing range with Mas scaling is a good pick, while healing can be used in a pinch to keep Ellisant healthy without relying on others.",
    "Tips": "Ellisant can either be used as a pure support, or a combat unit. As a pure support you can let your weaker unit, like a poorly grew Gywn to be in this class, focusing on applying Acc buffs to allies in order to take down dodgy enemies. As stats do not matter in this case, you can choose Nightblade or Gallant as yout tier 2 option for more support skills.<br/>If used as a combat unit, player need to bare in mind that Ellisant is not good at countering. Thus if Full Draw is not available, Ellisant should try to only attack 1 range enemies, or enemies that is sure to be defeated by the attack. Rogue, Sellsword and Witch are all great target as they are 1 range and cannot counter, very dodgy for other units but not Ellisant, and Ellisant can apply debuffs on them, making them easier to be taken down by your other units.",
    "Rings": "Ellisant as a support can consider Charged or Farseer ring for more mana recovery or larger range. Lava and Mystic ring are also decent choices, these two rings are also good for combat Ellisant as it can increase the range of Full Draw.<br/>For combat, Ellisant can use Blazing or Soulfire ring for more damage output. Archmage ring can also be used for increasing range of Full Draw.",
    "Weapons": "",
    "Class": "As mentioned above, Seeker provide extra debuff on attack and has similiar stat growth, making it a synergetic pick. Nightblade has great utility skills, a good choice for support Ellisant, but not for combat. Gallant provide great Mgt growth, making Ellisant hits harder, which is a good choice if player wishes for a nuke Ellisant."
  },
  {
    "ID": 24,
    "Classline": "Vanguard",
    "Tier": 3,
    "Name": "Champion",
    "Rating": [8.0, 2.8, 3.4, 4.9, 5.0, 2.0],
    "Stats": "Champion's stat modifiers focuses on HP, Mgt and Def, with a little in Mas. The class also has negative modifier in Spd and Lck.In terms of growth, Champion has high growth in HP, Mgt and Def, decent in Dex, with mediocre Mas and terrible growth in Spd, Frt and Lck.<br/>Champion forcuses on Physical bulk, as well as raw Power. The class is capable of dealing huge damage in a single strike, as well as tanking Physical damages, but will not double or crit, easily be doubled, and be decimated by Magical attacks. Skill num is also not high.",
    "Character": "Champion's strength lies in high HP, Mgt and Def, which is embraced by Benji. Benji will be a standard Champion, capable of dealing huge chunk of single strike damage and taking Physical hits. Benji also has slightly more Frt and Lck than most other Vanguard, but he is still frail Magically.<br/>Valeria is the polar opposite, which makes Champion Valeria a balanced unit in all areas except atrocious Lck. Champion Valeria will have great bulk due to her innate high Frt, making her a decent tank both Physically and Magically. She will also have good combat damage and decent Skill num, but her good Spd will be wasted because she is unlikely to double most enemies.<br/> Vissarion is better than Benji at power and physical bulk, though his magical bulk is atrocious and Lck is even lower. He will be a one hit wonder wil decent Acc and good Skill num, but he will never double or crit.<br/>Gwyn is capable of displaying the strength of Champion, and plays similiarly to Benji or Vissarion, but she is weaker than others in the boon and just as weak in the bane, making Champion Gwyn not the optimal choice.",
    "Upgrade1": ["Low", "Low", "Low", "Mid"],
    "Upgrade2": ["Mid", "Mid", "Low", "Mid"],
    "Skills": "Champion is a high Power low TSpd class, which is further enhanced with its passive, Titanic. With Titanic, Champion is likely to have single digit Spd well into the late game. However, the amount of damage Champion can do in one hit will also be unparalleled.<br/>Cut Them Down and Push Forward are two very similiar abilities, both are normal attacks with enhanced effect of cleaving and damage adjacent enemies, or healing adjacent allies. Note that due to Champion being a 1 range attacker, Cut them Down can only affect up to 3 enemies(not counting the original target). Increasing Mas scaling makes the skill stronger while reducing cost makes the skill usable more often. Push Forward is the stronger of the two skills, capable of recovering Champion's own HP after a successful attack.",
    "Tips": "Champion is a frontline class capable of dishing out huge damage and takes quite a bit in return. Player can open with Champion against strong physical enemies. One thing to note about both of Champion's skills is that if the attack misses, the consequent effects will also not trigger, so using Seeker/Ellisant to increase Champion's Acc is a legit strategy. Champion usually has very low Frt, and slow Spd leaves it prone to getting doubled, so player needs to be careful not to leave Champion in range of Magical enemies during enemy phase.",
    "Rings": "Champion's passive gives percentage increase to power, which will increase in effect when CHampion's base Power increases, thus Power increasing rings are great for Champion. Blazing ring is a power choice that can provide huge power boost if it triggers. Karmic is also a decent choice as Champion has a huge HP pool and is capable of taking big chunks of damage.<br/>In terms of bulk, Antimage and Tanquility rings are good ways to alleviate the glaring weakness against Magic enemies. Equilibrium ring can also be used to increase unit's Frt as the cost of lowering Def.",
    "Weapons": "",
    "Class": "Champion's precessor Gallant is a good choice as it increases Power for more damage, synergetic with Champion's playstyle. If player wishes to patch up Champion's Acc or Crit, player can opt for Seeker or Devoted either a growth option before promotion, or tier 2 option during promotion. Nightblade is not recommended as Champion is likely to be too slow to double majority of enemies even with Nightblade."
  },
  {
    "ID": 25,
    "Classline": "Hunter",
    "Tier": 3,
    "Name": "Warden",
    "Rating": [5.8, 5.0, 3.4, 6.1, 7.5, 5.0],
    "Stats": "Warden's stat modifier focuses on HP, Mgt and Def, with a little boost in Spd and Lck. The class has negative modifier in Dex, Frt and Mas. In terms of growth, Warden excels in Mgt, with decent growth in HP, Spd and Def, mediocre growth in Dex and Lck, and bad growth in Frt and Mas. <br/> Warden is a tanky class against physical enemies with great damage output. It is a combat class mainly focusing on raw stats with poor Skill num.",
    "Character": "Warden is a physical tank that can dish out decent damage, and Tusk fits this role nicely with his huge HP and Mgt growth, and good Def growth. He is also respectably fast for a tank, capable of avoiding doubling from middle Spd enemies. He will have te issue of extremely low Frt and Mas, so he should not try to engage fast Magic enemies like Witches and his Skill num will be very low.<br/>Riordan is also a good condidate for Warden, with great HP, Mgt and Def, and more importantly a good Frt growth. This makes RIordan a good tank even when facing Magic enemies. Riordan will be slower than Tusk, especially with Tusk's passive ignoring weapon Wgt but his own increasing Wgt, but his Mas is higher so his skills are somewhat stronger. One problem with Warden RIordan will be his low Dex, while RIordan can dish out good damage and actually has a decent crit chance thanks to his ok Lck, his Acc will be very low, especially against more dodge enemies, so player should think of a way to fix that if they still want Riordan to be able to deal damage.<br/>Eve's personal growth are quite strong that even with Warden's completely opposite growth emphasis, Eve remains a high Spd and Lck unit. She will have ok HP and good Mgt thanks to Warden, but her defenses are still relatively low. Her Dex will also be mediocre, making her passive less effective.<br/>Zanele is in a similiar situation as she is a unit focusing on Spd and Mas, two things Warden is not very good at. She will have good Mgt, but all her other stats will not stand out, making her a unit in the middle of nowhere, she cannot double effectively, and her skills will be less effective than usual.",
    "Upgrade1": ["High", "Low", "High", "Low"],
    "Upgrade2": ["Mid", "Mid", "Low", "Low"],
    "Skills": "Warden's passive gives adjacent ally 6 more Def, including Warden itself. This is a nice buff during the mid game providing more bulk for Warden. However, much like its precessor Ranger, flat buffs will fall off as the game progresses. Nonetheless, Warden is still a valuable tank during the mid game.<br/>Sic em summons a bear as a yellow uncontrollable ally, drawing enemy attacks. It is a nice skill as in Dark Deity enemies will priortise targeting yellow units unless player units are in kill range. It is extremely costly so cost down should be your priority in upgrade.<br/>Command Grizzly is a standard Hunter Red skill that adds a pet attack to unit's normal attack, and also incurs a Stun debuff. A 2 turn Stun debuff is nice if you are being overwhelmed and cannot deal with a specific threat quickly, buying you 2 turns. Note that this does not stop counter-attacks, including the one that might happen when Warden uses Command Grizzly. Command Grizzly is once again a hefty cost skill, so player should try to reduce its mana cost. Increase stack will increase Stun duration by 1 more turn, but this is unneccesaay most of the time.",
    "Tips": "Warden is a physical tank, capable of dealing damage and even has a passive that makes nearby allies bulkier. It is the perfect class to block off 2 space passages, or protect 2 range attackers behind Warden. Sic em is also a nice skill to provide a decoy to draw enemy attacks away from your units, something very useful in Demonic. Player should not bother with powerful skills in Warden due to the class's low Mas, and also keep Warden away from Magic or dodgy enemies.",
    "Rings": "Warden's main downfall is its low Frt and Dex. For Frt, Tranquility and Antimage rings are decent choices, Ghoul ring is also a good choice due to Axe usually having high Wgt. For low Dex, player can opt for Solitude ring, which works well with Tranquility, or Flux ring, which can heavily penalise high Acc enemies.<br/>Other bulk increasing rings are also decent choices for Warden, including Hallowed, Dauntless, Dimming, Indomitable and Guardian. Dimming is a good choice as Warden's skill does not really scale with Mas, thus losing them for more defenses is a worthy trade-off. Indomitable synergies well with Flux ring.",
    "Weapons": "",
    "Class": "Warden's precessor, Ranger, is a synergetic class as it is also a tank class with a passive that increases survivability. Just note that both passives will fall off near the end game, and the higher the difficulty, the sooner that happens.<br/>If player wishes to improve Warden by growth, Quickdraw is a decent growth option to give Warden more Spd and Dex, while retaining the high Mgt growth. Just note that as Warden is very unlikely to double, it is better to switch out Quickdraw for a tier 2 class with better passive when promoting.<br/> Tamer is a good choice if player wishes for more Mas and stronger skill effects, but Warden's own skill are usually not worth the effort."
  },
  {
    "ID": 26,
    "Classline": "Hunter",
    "Tier": 3,
    "Name": "Slayer",
    "Rating": [4.2, 7.3, 4.8, 6.6, 7.5, 3.0],
    "Stats": "Slayer focuses on Spd and Lck in terms of stat modifiers, with some boost to HP and Dex. It has no modifier for Mgt and Frt, but a negative modifier for Def and Mas. In terms of growth, Slayer has great growth in Spd and Dex, decent growth in Mgt and Lck, ok HP growth but bad Def, Frt and Mas growth. <br/>Slayer does not have good Bulk or Skill num, but is a great combatant and dodge tank with its decent Mgt, fast TSpd, Dodge and ability to crit well.",
    "Character": "Slayer is a fast crit machine that does not focus on skills or bulk. Eve is very fitting in terms of growth. Her bulk is poor, but that is a trivial matter with her high Spd and Dodge. Her mgt is not very high, but that is also mitigated by her own passive. She is fast, hits decently hard, very accurate, and very good crit due to her high Lck. Her only really downside is her low Mas, so just do not expect her skills to do much more than its base numbers.<br/>Zanele is also a fast and accurate unit. She does have low Lck so she cannot crit as reliably as Eve, but beside that she is as good as Eve in terms of combat performance. The downside of Slayer Zanele is the low Mas, which is a huge demerit for Zanele due to her invaluable personal skill.<br/>Tusk will have good HP, Mgt and Def, while retaining decent Spd and Dex. He will be a fast and strong attacker, though he will have extremely low Skill num and unreliable Crit. He is also more physically bulky and less dodgy, so while he still can fight at the front line, he functions a little differently. He will have abysmal Mas, so his skills will not be very powerful.<br/>Riordan will not be very fast, making him unable to dodge properly. His bulk is okay but not as good as Tusk. This makes Slayer not a great choice for Riordan, as his combat performance will be subpar compared to the rest.",
    "Upgrade1": ["Low", "Low", "Mid", "Mid"],
    "Upgrade2": ["Mid", "Mid", "High", "Low"],
    "Skills": "Slayer's passive gives the unit an extra chance to attack again. Ricochet can trigger off any attack bar another Ricochet attack, so with Ferocity rune and doubling at base, it can turn into a maximum of 8 attacks. It is a good way to improve damage, but 20% is not a reliable trigger chance, so player should not bet on it triggering in crucial situations.<br/>Stinger Strike is a simple 2 turn Stun, capable of disabling a unit from up to 3 tiles away for 2 turns. It also does not have a Mas scaling, which is great for a class with low Mas like Slayer. Its cost is considerably low, so increasing range is a better upgrade than cost down.<br/>Command Wyvern is a typical Hunter Red skill with additional damage on attack, and apply a Severe Poison debuff. The stack number is not very high, and is unlikely to scale much higher due to low scaling percentage as well as Slayer's low Mas. However, the Severe Poison itself is extremly powerful even at its likely range of 4-5 stacks, not to mention player can easily increase that by 5, effectively doubling it, with a simple upgrade. The skill has a cheap cost, so reducing cost is good but not necessary. The stack number increase is very good due to afore mentioned reasons, and healing is not necessary as Slayer is a dodge class not a tank class.",
    "Tips": "Slayer is a good combat class with good dodge. While the class itself does not have any skills boosting dodge, its precessor Cutthroat is a powerful Dodge class with a powerful dodge increasing passive that can be effectively used by Slayer as well, making Slayer probably the strngest class in game. Player should have no issue putting Slayer in the middle of several enemies and watch Slayer dodges all attacks and defeating enemies with counters using its 1-2 range and fast crits coupled with Ricochet. Some points to note that is in higher difficulties such as Demonic, enemy Accuracy will get high and if Exhaustion builds up, Slayer is still prone to be hit, so player should not misjudge and get too greedy, and should always keep a healer nearby just in case.",
    "Rings": "Slayer should focus on dodge rings such as Diplomat or Depth ring, making Slayer untouchable.<br/>Slayer is a powerful class that does not have much weak points, so player may simply consider utility rings like Siphon rings to level up and obtain a powerful unit faster, or Hurricane ring for extra movement, allowing Slayer to reach enemies faster.",
    "Weapons": "",
    "Class": "Slayer should go with its precessor, Cutthroat as the class will provide the extra Dodge that makes Slayer into a dodge tank. Cutthroat also has the powerful utility skill Licky Lasso that Slayer can use since Slayer's own skills are somewhat lacking. <br/>Quickdraw is an interesting choice for tier 2 option because it is also fast and has much better Mgt growth than Cutthroat. Quickdraw's passive Alacrity can proc off Ricohcet for more mana regeneration too, though poor Mas from both classes would mean that Skill num will be low."
  },
  {
    "ID": 27,
    "Classline": "Hunter",
    "Tier": 3,
    "Name": "Beastmaster",
    "Rating": [8.0, 2.9, 5.4, 3.9, 9.5, 6.0],
    "Stats": "In terms of stat modifiers, Beastmaster focuses heavily on HP and Mas, with a little Mgt, Def and Frt, but has negative modifier in Spd, Dex and Lck. Growth-wise Beastmaster still has sky-high growth in HP and Mas, decent Mgt, Def and Frt, but low Spd, Dex and Lck<br/>Beastmaster is a class with good bulk and huge HP pool, though due to low Spd, is prone to be doubled. Its basic combat is also lackluster, with middling Power and terrible Acc, Crit, and almost no chance to double. Its main draw is its high Mas, making its skills very effective. This, coupled with its passive, makes Beastmaster a spammer of powerful pet commands.",
    "Character": "As a pet command spammer, Beastmaster's only stat that matters will be Mas. Zanele has the highest Mas growth, as well as powerful personal skill, and a passive that further boost effectiveness of pet command skills, making Zanele an excellent Beastmaster. With Tamer/Beastmaster, Zanele sould be capable of firing off skills with damages on the same level of a well-built Arthur, though less flexible in terms of range. Zanele will have passable combat with her decent Mgt and Dex, but she will be slow and her bulk will be wittled down by enemies double attack.<br/>Riordan has great Mas and HP, good Mgt and defenses, making him a good bulky tank and strong attacker. However, he will have atrocious Spd and Dex, making his attack very inaccurate. Beastmaster Riordan will play like a tank with his good bulk and Block from Command Cerberus.<br/>Eve will have a balanced spread of stats, she will have good Mas if she wishes to use skills, but she will also not be fast enough to double a big portion of enemies unlike some other tier 3 classes. Overall Beastmaster Eve does not stand out in any area and will be weaker than Zanele and Riordan in Mas.<br/>Tusk has more than 100% growth in HP, giving him a chance to grow 3 HP in one level. He also has good Mgt and decent Mas to deal damage from combat and skills. He will be played as a nuke, capable of dealing huge damage, but his low Spd and Frt means that he will be vulnerable to fast Magic enemies like Magi or Witch.",
    "Upgrade1": ["Low", "Mid", "High", "Mid"],
    "Upgrade2": ["Low", "Low", "High", "Top"],
    "Skills": "Beastmaster's passive halves mana cost of pet commands, which includes all Red skills in Hunter classline, both personal and class skills include. This is a very powerful effect, making skill spam possible. Zanele's personal, for example, now effectively only costs 5 mana per turn after accounting for the natural mana recovery, effectively allowing her to use that skill every single turn without worrying about cost.<br/>Hellhound Breath applies Snare debuff in an area od 7 tiles, one adjacent to user, three more in a straight line behind the first tile, forming a T shape, the last three behind the 3 in the second line, forming a cone shape. Snare is not a very powerful debuff, especially since enemies targets are already near you, but it can prevent some of your close by frailer units from being attacked by multiple enemies. Stack +1 is an interesting upgrade, as all enemies have 5 movement unless if they have special skill or on special tiles, meaning they only have 1 movement if they are affected by 4 stacks of snare, making some of them cannot reach you despite being just 2 tiles away. 4 stack of Poison is a great upgrade too, turning the skill into a powerful AOE Poison.<br/>Command Cerberus is a powerful skill that deals good damage due to high Mas scaling, and also applies Heavy Block to user. If you are going for a bulky Beastmaster build, this skill is very good at keeping the user alive. Healing user is an extremly synergetic skill, vastly increasing Beastmaster's longevity, and should a top pick for a bulky Beastmaster.",
    "Tips": "There are two main ways to play Beastmaster, both are not mutually exclusive. The first is to treat Beastmaster as a skill based nuke, dealing heavy damage but not caring much about combat performance. The other is to use Beastmaster as a tank, and focus more on Command Cerberus for Block and heal. Both plays similiarly on player phase as both will be using a lot of Red skills, however nuker Beastmaster should avoid facing enemies during enemy phase due to poor combat ability. It is also best to not leave Beastmaster in range of a Magic enemy regardless.",
    "Rings": "Beastmaster would enjoy rings that increases skill effectiveness, so Lava and Mystic rings are both extremely powerful picks. Mana rings are unnecessary because of Beast Whisperer. <br/>Players may opt for bulk increasing rings such as Tranquility, Dauntless and Dimming if they chose the bulky build.",
    "Weapons": "",
    "Class": "Beastmaster's precessor Tamer is an extremely synergetic pick for Beastmaster, as it provides high Mas growth, as well as a pssive that scales with the high Mas the two classes shared, making pet commands, nuke even harder.<br/>Ranger is a decent pick for bulky Beastmaster, providing more Def and a bulk increasing passive. Able to heal off Command Cerebus also makes it possible to trigger Ranger's passive multiple times without outside help."
  },
  {
    "ID": 28,
    "Classline": "Hunter",
    "Tier": 3,
    "Name": "Deadeye",
    "Rating": [3.7, 6.9, 5.4, 8.6, 7.0, 2.0],
    "Stats": "In terms of stats, Deadeye focuses on Mgt, Spd and Dex, with no modifier in Def and Lck, and negative modifier in HP and Frt. Interms of growth the class excels in Mgt, Spd, Dex, and is good in Mas as well. All the other growths are rather lackluster.<br/>Deadeye is pretty good in terms of combat, being able to hit hard, accurate and fast, though not so reliable in crit. It also has some dodge due to fast Spd but bulk is atrocious. This combined with its lack of 1 range, makes Deadeye a powerful player phase class which should not enemy phase.",
    "Character": "Deadeye is a combat focused class, the class emphasizes on Mgt, Spd and Dex, which Tusk and Zanele are both excellent choices. Tusk also has great HP and good defense to take a few physcial hits, while Zanele has a more even spread in growth and also has great Mas. Tusk can worry less about getting hit by physical enemies during enemy phase, while Zanele can pull of effective skills too instead of solely relying on pure combat.<br/>Eve is the fastest with decent Mgt and Lck too, making her the most reliable at critting. Eve can consider a classline of Cutthroat/Deadeye, for good dodge and damage at the same time.<br/>Riordan will have ok Spd and good Mgt, but his Dex will take a hit. His Mas is ok but other stat growths are mediocre, making him not a great choice for the best Deadeye.",
    "Upgrade1": ["Mid", "Mid", "Mid", "Mid"],
    "Upgrade2": ["Low", "Low", "Low", "Mid"],
    "Skills": "Deadeye's passive gives the unit even more damage if there is an overkill. It can trigger if the unit uses the Red skills, but will not work if the pet is the one dealing the killing blow. Thus passive is quite limited, as it forces Deadeye to be dealing the killing blow every time in order to keep proccing this passive, but can be quite powerful if player can stack up and snowball this damage. Perfect to use with overkill related rings and runes.<br/>Wing Buffet is an interesting skill, applying a special kind of unique debuff on enemy, making them prone to be doubled. It works really well if paired with heavy hitting slow attackers, namely Champion. It can also help Deadeye double fast enemies such as Rogue or Sellsword, enemies that Deadeye cannot double usually despite its inherent high Spd. Doubling enemies also makes it having more overkill damage. Reducing cost is the better upgrade if player wishes to constantly support Deadeye itself to double, while Range +1 is better if player wishes to use this skill to support others.<br/>Command Hawk is a standard Hunter Red skill that adds an extra pet attack during normal attack and adds a Blind debuff. Blind debuff is not very effective especially on higher difficulty due to enemies with inherently high Acc. It is also useless against Truseeing enemies. It can be used to make enemies miss Deadeye due to Deadeye's inherent high Spd and thus Dodge, but it is not very effective. Deadeye would also wants to outright kill the enemy in order to trigger its passive, so the debuff will not really help allies either.",
    "Tips": "Deadeye wishes to engage enmies in combat during player phase, and control overkill damage to stack up these damage for a big burst against the boss. This is especially useful against the final boss who has a ton of HP. It is best to make Deadeye fast to doulbe as many enemies as possible and also crit more often as that will significantly boost the overkill damage.<br/>Deadeye is a 2 range unit, which means it is weak and unable to counter at one range. Its defenses are also very low, and while its dodge is high, it does not have much dodge boosting skills unless it goes Cutthroat, so it is still best to leave Deadeye out of harms way and not engage enemies, not only because of bulk issue, but also unnecessary battles might ruin the extra damage stored by Deadeye's passive.",
    "Rings": "Deadeye's passive makes it great with power increasing rings. Blazing, Bloodied and Advantage rings are all decent options. Competitor ring gets a special mention because effect triggers when the wearer makes a kill, which is the same as Deadeye's passive's triggering conditon. For every kill, Deadeye not only gets half of the overkill damage as extra damage for next attack, but also 1 extra power for the rest of the chapter.",
    "Weapons": "",
    "Class": "Deadeye's precessor is Quickdraw, which is also fast with good Mgt and Dex. The two are similiar growth-wise, and both would enjoy being able to double the enemy, more so with Quickdraw as its passive hinges on it. However, other than that, there is no significant synergy between the two, as Deadeye is not that skill dependent to utilise Quickdraw's mana regen. Neither classes have good Mas or skill effects.<br/>Cutthroat is an interesting option, because it has really good Lck for better critting, as well as a dodge increasing passive which works well with Deadeye's high Spd."
  },
  {
    "ID": 29,
    "Classline": "Summoner",
    "Tier": 3,
    "Name": "Cosmician",
    "Rating": [5.0, 4.4, 5.6, 3.7, 10.0, 4.5],
    "Stats": "Cosmician focuses on HP, Mas and Lck, with good stat modifier in Mgt and Def too. It is weak in terms of Spd, Dex and Frt. In terms of growth, Cosmician has good growth in HP, Def and Mas, ok Mgt and Lck, but bad Spd, Dex and Frt. <br/>Cosmician is a class focusing on extremely high Skill num but not great in terms of combat. It has decent physical bulk, and is capable of dealing good combat damage, but its low Dex and Spd means it cannot double or hit very accurately.",
    "Character": "As a skill focused class, Mas is the most important stat for Cosmician. Arthur does well with his highest in-game Mas growth as a Cosmician, making him an extremely strong Skill damage nuke. He also have high Mgt, making him decent at dishing out combat damage with correct set-up such as Wizard rune, but it is usually used as last resort as he is vulnerable to counter-attacks from enemies.<br/>Alden is bulky physically, but is worse than Arthur in all other areas like Skill num or combat performance. He can be used as a secondary nuke if desired as he still has very high Mas growth, but it is generally recommended to either not use him as a Cosmician, or simply use the class as a Mas battery to fuel his tier 2 class skills such as Aegis's Repulsor Shield.<br/>Aya has high Mgt and Lck growth, making her combat stronger, but her true strength lies more in her personal skills, which when combined can boost her Mas even higher, making her fire off skills even stronger than Arthur's, despite her lower Mas growth.<br/>Calith starts off in Geomancer, which naturally progresses into Cosmician, but her growth are quite average, with a 25% Spd growth holding her back from regular combat, and the lowest Mas growth amongst the 4 units, making her a rather poor choice for Cosmician.",
    "Upgrade1": ["Low", "Mid", "Mid", "Mid"],
    "Upgrade2": ["High", "High", "Mid", "Mid"],
    "Skills": "Cosmician's passive is very powerful boost to the nit's skill num. The extra 15 Mas when coupled with the class's inherent high Mas growth will be the best in game in terms of Skill num and effect. DO note that it only activates at full HP, so player should avoid attacks from enemies or constantly top up this unit's HP.<br>Astral Reckoning is one of the largest AOE nuke in game, targeting a maximum of 9 enemies. It is expensive and not as powerful damage wise compared to single target nukes, so players should be careful when to use it. Heavy Snare and heals are ways to support teammates, though the high cost makes this skill a poor utility choice.<br/>Meteor is the strongest single target damage skill in game at a reasonable cost. It can reach 3 range on its own, and has an extremely high Mas scaling, synergetic with Cosmician's high Mas. Player can focus on range or scaling, or reduce cost and add utility if they wish.",
    "Tips": "Cosmician is a very Mas and thus Skill focused class. It has mediocre bulk and lackluster dodge, and with a passive that only triggers at full HP, it is not a combat focused class. Player can simply use Cosmician as a nuker with its powerful Meteor, or use the skills of tier 2 skills such as support using Geomancer or Scholar, or powerful long range Hellfire as Warlock. One advice for Arthur as Cosmician is pick different upgrades for his personal skill Lunar Reave and Meteor, like Mas scaling up for Meteor and Range +1 for Lunar Reave, to avoid having two extremely similiar skills and render one meaningless.<br/>Cosmician can deal good damage for combat, but will be doubled and unlikely to dodge. Player should avoid leaving Cosmician in range of enemies during enemy phase.",
    "Rings": "Cosmician will like using rings that focuses on skills, including skill num boosting, range increasing or mana recovery increasing. So the following list of rings will be great: Lava, Mystic, Inferno (Meteor benefitting from it), Archmage, Charged.",
    "Weapons": "",
    "Class": "Cosmician's precessor is Geomancer, which also has a great Mas growth. Geomancer also has great support utility skills, which when combined with Cosmician's purely Red skillset, provides great coverage in terms of effects.<br/> Warlock is also a strong tier 2 choice for Cosmician, as Warlock has arguably the strongest skill effects amongst all classes in game with its powerful long range nuke and AOE Poison debuff. Warlok's Hellfire also benefits from Inferno ring similiar to Meteor. It is common to see Summoner units level up in Geomancer for its Mas growth, but switching to Warlock before promotion for its skillset.<br/>Aegis and Scholar are similiar in that they both have powerful skills that are useful for the player, and Cosmician will provide a powerful Mas buff to make these skills even more powerful. They are less recommended than Geomancer or Warlock in general, but still powerful and useful choices nonetheless."
  },
  {
    "ID": 30,
    "Classline": "Summoner",
    "Tier": 3,
    "Name": "Necromancer",
    "Rating": [4.5, 4.2, 4.5, 5.4, 7.0, 5.0],
    "Stats": "Necromancer focuses on Mgt and Dex, with some stats on Frt and Mas. It has few or no stat modifier for HP, Spd and Dex, and negative Lck modifier. In terms of growth, Necromancer has great Mgt, Dex and Frt growth, ok HP growth, but poor growth in other areas.<br/>Necromancer is a class that has on hard and accurate attack, but not good at doubling or critting. The class has decent skill effects, but the Mas scaling is not very good. The class thus lacks a clear focus and requires unit growths to determine the path to go.",
    "Character": "Necromancer can play differently for different unit. Arthur has a respectable Mas growth, thus making necromancer's skills stronger. He can go down a more skill focused path with extra mana regeneration from his and Necromancer's passive. it is recommended to go Geomancer for tier 2 for better Mas.<br/>Aya and Calith has poor Mas, but good growth in Mgt, Dex and Lck. These two can become more combat oriented, dealing good combat damage and use skills as compliment. However, these two have poor Spd and poor Physical bulk (Calith), or just poor Bulk altogether (Aya). It is recommended to go for Warlock as tier 2 class for more HP recovery.<br/>Alden has good Bulk as Necromancer, but neither his combat nor his Skill num are that impressive. Player can try to go for a more tanky build, with Aegis as tier 2 choice to tank and heal up with Darin Life, but it is usually not the most effective tanks in game.",
    "Upgrade1": ["Mid", "High", "High", "Mid"],
    "Upgrade2": ["Mid", "Low", "Mid", "High"],
    "Skills": "Necromancer's passive gives quite a lot of mana if enemies dies within 2 tiles range, an important effect if player wishes to use high cost Skills. However, as Necromancer is neither tanky nor dodgy, it is a risky play. Necromancer itself also has mediocre kill potential, making this passive very peculiar.<br/>Animate is the signature skill of Necromancer, usually summoning a Soldier with stats with the displayed % of the first fallen enemy. In Demonic difficulty, enemy stats are usually quite high, often outmatching your units. Animate can provide a powerful decoy that can take many hits or deal a lot of damage. Increasing Mas scaling is a very strong upgrade. In lower difficulties, players may choose to use this skil more as a simple decoy, thus reducing cost is the highest priority. Halving cost and effect may be desirable as Animate is a costly skill and decoy quality is not of concern.<br/>Darin Life is a skill that deals damage and heals at the same time. It can vastly increase the longevity of Necromancer. Increasing Mas scaling is most effective as the skill cost is rather low already. It is advisable to use a tanky build if player wishes to focus on using this skill.",
    "Tips": "Necromancer lacks a focus of its own, and thus has many way to actually play it. A tanky build can utilise Drain Life to keep itself healthy for taking on more enemies. Support Necromancer can spam Animate, sending decoys to draw enemy attacks away from player units, or even battle dangerous enemies. Necromancer can also do some combat and be a combat tank using Warlock's Blackflame and its own Drain Life to keep its HP topped up during both player and enemy phase.<br/>Lacking a focus also has downsides, though. It does not excel in any area, and is often a more convoluted way to play something other classes can do better with less effort. Neither of the skills are particularly powerful enough to turn the tide of battle and players often would seek other choices instead.",
    "Rings": "Necromancer can go for skills or combat. Skill focused Necromancer can go for Charged ring to boost Mana recovery, or simply uses Lava or Mystic ring for much stronger skills.<br/>Combat Necromancer can opt for Bloodied ring to get more secondary stats, most importantly TSpd and Crit. Another good choice is the Chosen ring, which can nerf the Power of powerful enemies, making Necromancer harder to overpower.",
    "Weapons": "",
    "Class": "Necromancer can go with many different tier 2 options. Geomancer is great for better Mas growth pre-tier 3, Aegis is great for better defensive stats for a tankier build, and Warlock is the precessor class and provides great Skills and more HP recovery during enemy phase."
  },
  {
    "ID": 31,
    "Classline": "Summoner",
    "Tier": 3,
    "Name": "Relic Knight",
    "Rating": [7.8, 3.7, 3.4, 3.7, 5.5, 1.0],
    "Stats": "Relic Knight is a class focusing on Def and HP. It has very little stat modifier elsewhere. In terms of growth, the class focuses on HP, Def and Frt. It has ok Mgt growth but low growth everywhere else.<br/>Relic Knight is a class focusing on Bulk, more so on physical side but not bad on magical side too. It is not a good combat class or skill class.",
    "Character": "Relic Knight is not a great combat class, and none of the characters will do especially well in combat if classed into a Relic Knight. Alden will have very good bulk as a Relic Knight, with very high growth in HP, Def and Frt. He will have ok Mgt and Mas, letting him have ok Skill num for his skills, and can deal some damage when forced into combat, but his poor Spd, Dex and Lck will make his combat performance terrible.<br/>Arthur has great HP and Frt, making him a decent Magic tank. He has decent Mas for better Skill num, and he will perform better than Alden in combat. However, Arthur is still not a combat unit and should only focus on Skills.<br/>Aya has best Mgt, Spd and Lck, making her the best in terms of combat. However, Aya also has the worst bulk amongst the four, severely limiting her combat performance.<br/>Calith has decent bulk and ok Mgt, good Dex and Lck, making her a decent choice for combat if needed. However, her abysmal Mas held her back as her skills are going to be very low in numbers.",
    "Upgrade1": ["Low", "Mid", "Mid", "Mid"],
    "Upgrade2": ["Mid", "Low", "Mid", "Mid"],
    "Skills": "Relic Knight's passive indicates that the class want to kill enemies, but its skills involve getting close to enemies and engage in combat. However, Relic Knight is not a good combat class, making the passive somewhat a misfit.<br/>Bladestorm allows Relic Knight to attack three times during combat. If Relic Knight would double, the follow-up attack will be the 4th strike at normal power. If Ferocity rune is attached, Relic Knight will attack 6 times for the supposed first attack, and 2 more times if double. The Mas scaling works a little differently for this skill: at 0 Mas the attacks will have 60% reduced power, ie. 40% original power, the reduction decreases as Mas increases, ie, power increases. At 86 Mas, all three attacks will be at normal power. Percentage Mas scaling for the skill is -70% at base, and can decrease to -90% if upgraded. Player can choose to get the heal upgrade to increase unit's longevity, or reduce mana cost for increased conssitency.<br/>Swirling Blade is an interesting but hard to use skill, requiring enemies to be adjacent to the user during start of player phase. It is hard to achieve as enemies with 2 range will tend to be 2 tiles away, and adjacent enemies may either be too weak to stay alive at lower difficulty, or too strong for Relic Knight to safely move into range at higher difficulty. If activated successfully, it can be an interesting skill to be used in tandem with Aegis's Repulsor Shield to defeat enemies without reliable combat ability of itself.",
    "Tips": "Relic Knight is a strange class that tries a few things but ultimately excels at none. It has decent bulk, but nothing too impressive compared to the likes of Godfrost, Dreanought or Warden. It tries to push for combat kills but unlike Champion which is much more striaght forward, Relic Knight's skills are too unreliable. Its skills are all unique and no other class offers remotely similiar effects, making Relic Knight a fun class to try out at first, but its lackluster performance at both tanking and killing makes this class an afterthought for lower difficulties, and almost completely ignored at higher difficulties.",
    "Rings": "In terms of rings, Relic Knight can go for bulk boosting rings such as Dauntless, Dimming, Indomitable or Guardian, all of these boosts Relic Knight's bulk which makes the class survive better against enemy attacks in order to make use of Swirling Blade or Bladestorm.",
    "Weapons": "",
    "Class": "Relic Knight's precessor Aegis is probably the only viable choice, as Aegis provides good bulk and a powerful skill in Repulsor Shield that can be used to support Relic Knight's Swirling Blade. None of the growths or skills from other classes are particularly useful for Relic Knight."
  },
  {
    "ID": 32,
    "Classline": "Summoner",
    "Tier": 3,
    "Name": "Loremaster",
    "Rating": [3.1, 6.1, 5.1, 5.0, 7.5, 8.0],
    "Stats": "Loremaster is a class focusing on Spd and Mas, with some stat boost in HP, Mgt and Dex. It has negative stat modifier in Frt. In terms of growth, Loremaster has good growth in Mgt, Spd and Mas, ok HP, but poor growth in all other areas.<br/>Loremaster is a class that has decent combat with its good Mgt and Spd, as well as decent Skill num, but its lackluster bulk makes the class somewhat a glass cannon, or a backline support.",
    "Character": "Loremaster can be used as a combat unit, or a support. Aya is arguably the best in terms of combat, with the highest Mgt, Spd and Lck growth, as well as second highest Dex growth amongst all units. The high Spd growth is especially important if she wishes to double enemies in order to trigger Poison and Blackflame as a Warlock. She will also have decent Mas for her skills. However, her Dex is still rather mediocre, despite being the second highest amongst all Summoners. Her bulk is also paper thin, making her extremely vulnerable if she fails to trigger healing from Blackflame.<br/>Arthur has decent Mgt, Spd and Mas as Loremaster, making him a somewhat decent candidate for the class. However, Arthur's poor Dex and Lck greatly hinders his damage output, making him an ok combat unit at best. Additionally, while his Mas growth is certainly good, it is nothing compared to the monstrous Mas he can obtain as a Cosmician, making Loremaster an odd choice for him if he wishes to pursue high Skill num.<br/>Alden starts off as Loremaster's precessor, Scholar, and will have a decent overall growth as a Loremaster. While he will have terrible Dex and Lck growth, severely hindering his ability as a player phase attacker, he will have decent bulk to take some damage while offering great support uility to is teammates.<br/>Calith has good Dex and Lck and decent Mgt and Spd growth, making her an ok combat mage. However, it is questionable whether you want to make her a second-rate combatant when you already have your team of better cattackers. Her low Mas and bulk is also holding her back from being a good support. ",
    "Upgrade1": ["Low", "Mid", "Low", "Low"],
    "Upgrade2": ["Mid", "Low", "Low", "High"],
    "Skills": "Loremaster's passive is a supportive passive, reducing cost of nearby allies. It does not affect itself. The skill is very good, often allowing allies to cast skills otherwise they lack the mana to use. It allows for use of skills throughout the game, greatly increases the consistency of many skill-reliant classes.<br/>The Breaker is the only way players can damage allies in this game. It has the niche utility to boost the power of Hemomancer's passive, or get around the side-effect of Conduit's Defribilate skill, but it is generally not desirable, especially on higher difficulties where you bulk is severely lacking. Player also should be cautious if upgrading for extra Snare effects as it will also apply for allied units.<br/>Rousing History is a powerful AOE debuff that can boost allies' damage output by applying Vulnerable debuff on enemies. It is a good skill if player wishes to clear out a group of condensed enemies. Upgrading for Poison stacks is highly recommended due to how strong Poison is in this game, and can also provide furthur decrease in defenses.",
    "Tips": "While Loremaster's skillset is not that combat focused, it is the class with the highest Spd growth amongst all Summoner classes. The class also sports decent growths or no negative stat modifier in other combat relevant stats like Mgt, Dex and Lck, making this class the most optimal if you wishes for a combat-centric Summoner unit. If you do not wish for a combat Loremaster, you can go for a more supportive role, espcially with its strong passive that reduces mana cost for nearby allies. Player should be careful with the unit's positioning, trying to cover as many allies as possible to take advantage of this passive.",
    "Rings": "If player opt for a combat focused unit, Bloodied ring is the best choice, providing more boost to TSpd and Crit. <br/>If player wishes for a more supportive role, Harmony ring is a decent option, providing buffs for adjacent units who also can benefit from Loremaster's passive.",
    "Weapons": "",
    "Class": "Loremaster can be a good tier 3 class for a few different tier 2.Scholar is the most natural choice, as the class has 2 very strong support skills, making Loremaster a strong and versatile support unit capable of providing a variety of utilities. Geomancer fits a similiar role, giving a different set of support skills for Loremaster, as well as providing more Mas growth for the unit before the promotion.<br/>Warlock does not provide as much in terms of utility and support, but instead appreciates Loremaster's high Spd growth to enhance its combat performance. Poison tanking strategy that Warlock uses would require the unit to be as fast as possible."
  },
  {
    "ID": 33,
    "Classline": "Shaman",
    "Tier": 3,
    "Name": "Dreadnought",
    "Rating": [8.0, 2.9, 3.7, 3.9],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 34,
    "Classline": "Shaman",
    "Tier": 3,
    "Name": "Tidecaller",
    "Rating": [5.2, 5.9, 4.8, 3.7],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 35,
    "Classline": "Shaman",
    "Tier": 3,
    "Name": "Spirit Keeper",
    "Rating": [4.3, 3.6, 6.6, 5.2],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 36,
    "Classline": "Shaman",
    "Tier": 3,
    "Name": "Hemomancer",
    "Rating": [5.7, 6.1, 4.7, 5.0],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 37,
    "Classline": "Adept",
    "Tier": 3,
    "Name": "Tempest",
    "Rating": [2.6, 8.1, 3.1, 6.7],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 38,
    "Classline": "Adept",
    "Tier": 3,
    "Name": "Stormkeeper",
    "Rating": [3.3, 5.2, 10.0, 6.3],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 39,
    "Classline": "Adept",
    "Tier": 3,
    "Name": "Godfrost",
    "Rating": [6.9, 3.8, 3.7, 5.3],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  },
  {
    "ID": 40,
    "Classline": "Adept",
    "Tier": 3,
    "Name": "Ascendant",
    "Rating": [3.6, 6.2, 5.4, 7.3],
    "Stats": "",
    "Character": "",
    "Upgrade1": ["Low", "Low", "Low", "Low"],
    "Upgrade2": ["Low", "Low", "Low", "Low"],
    "Skills": "",
    "Tips": "",
    "Rings": "",
    "Weapons": "",
    "Class": ""
  }
]
